/* T code table definitions:
	Coded for easy readability. Not for fast & compact coding

  2011. 8. Written by Jae Sung Lee

*/

// j : Private Jaso (Korean alphabet) writing - the glyph of initial cons(circled) and final cons(normal) are different
// k : Korean syllable format writing
// t : Tcode 

// k2t : input k string, output: t string corresponding to input k.   ÇÑ±Û -> haNgUL
// t2k : input t string, output: k string corresponding to input t.   haNgUL-> ÇÑ±Û
// t2j : input t string, output: j string corresponding to input t.   haNgUL -> ¨¾¤¿¤¤¨± ¤Ñ¤©
// j2t : input j string, output: t string corresponding to input j.   ¨¾¤¿¤¤¨± ¤Ñ¤© ->haNgUL

#define MAXK2T	2401	// Jaso(51) + HanCode(2350)
#define MAXT2K	2401	// Jaso(51) + HanCode(2350)
#define MAXTCODELEN	4	// including null code for string definition

#define MAXT2J	(19+21+28)
#define MAXJ2T	MAXT2J
#define MAXT2JCHO 20

char j2tindex[MAXJ2T*2] = {
 "¤¡¤¢¤£¤¤¤¥¤¦¤§¤©¤ª¤«¤¬¤­¤®¤¯¤°¤±¤²¤´¤µ¤¶¤·¤¸¤º¤»¤¼¤½¤¾¤¿¤À¤Á¤Â¤Ã¤Ä¤Å¤Æ¤Ç¤È¤É¤Ê¤Ë¤Ì¤Í¤Î¤Ï¤Ð¤Ñ¤Ò¤Ó¨±¨²¨³¨´¨µ¨¶¨·¨¸¨¹¨º¨»¨¼¨½¨¾©±©³©¶©·©¹" };
//0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 

char j2tglyph[MAXJ2T] = {
 "abcdefghijklmnopqrstuvwxyz{ABCDEFGHIJKLMNOPQRSTU.0134579:<=>?@/268;" };
//0123456789012345678901234567890123456789012345678901234567890123456

char t2jindex[MAXT2J] = {
 "./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUabcdefghijklmnopqrstuvwxyz{" };
//0123456789012345678901234567890123456789012345678901234567890123456

char t2jglyph[MAXT2J*2] = {
 "¨±©±¨²¨³©³¨´¨µ¨¶©¶¨·©·¨¸¨¹©¹¨º¨»¨¼¨½¨¾¤¿¤À¤Á¤Â¤Ã¤Ä¤Å¤Æ¤Ç¤È¤É¤Ê¤Ë¤Ì¤Í¤Î¤Ï¤Ð¤Ñ¤Ò¤Ó¤¡¤¢¤£¤¤¤¥¤¦¤§¤©¤ª¤«¤¬¤­¤®¤¯¤°¤±¤²¤´¤µ¤¶¤·¤¸¤º¤»¤¼¤½¤¾" };
//0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 

char t2jglyph_cho[MAXT2JCHO*2] = {
	"¤¡¤¢¤¤¤§¤¨¤©¤±¤²¤³¤µ¤¶¤·¤¸¤¹¤º¤»¤¼¤½¤¾"};
//   0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8

char k2ttbl[MAXK2T][MAXTCODELEN] = {
"a",   "b",   "c",   "d",   "e",   "f",   "g",   "2",   "h",   "i",   	// 0000 ¤¡¤¢¤£¤¤¤¥¤¦¤§¤¨¤©¤ª
"j",   "k",   "l",   "m",   "n",   "o",   "p",   "q",   "6",   "r",   	// 0010 ¤«¤¬¤­¤®¤¯¤°¤±¤²¤³¤´
"s",   "t",   "u",   "v",   ";",   "w",   "x",   "y",   "z",   "{",   	// 0020 ¤µ¤¶¤·¤¸¤¹¤º¤»¤¼¤½¤¾
"A",   "B",   "C",   "D",   "E",   "F",   "G",   "H",   "I",   "J",   	// 0030 ¤¿¤À¤Á¤Â¤Ã¤Ä¤Å¤Æ¤Ç¤È
"K",   "L",   "M",   "N",   "O",   "P",   "Q",   "R",   "S",   "T",   	// 0040 ¤É¤Ê¤Ë¤Ì¤Í¤Î¤Ï¤Ð¤Ñ¤Ò
"U",   ".A",  ".Aa", ".Ad", ".Ag", ".Ah", ".Ai", ".Aj", ".Ap", ".Aq", 	// 0050 ¤Ó°¡°¢°£°¤°¥°¦°§°¨°©
".Ar", ".As", ".At", ".Au", ".Av", ".Aw", ".Ay", ".Az", ".A{", ".B",  	// 0060 °ª°«°¬°­°®°¯°°°±°²°³
".Ba", ".Bd", ".Bh", ".Bp", ".Bq", ".Bs", ".Bt", ".Bu", ".C",  ".Ca", 	// 0070 °´°µ°¶°·°¸°¹°º°»°¼°½
".Cd", ".Ch", ".Cs", ".Cu", ".D",  ".Dd", ".Dh", ".E",  ".Ea", ".Ed", 	// 0080 °¾°¿°À°Á°Â°Ã°Ä°Å°Æ°Ç
".Eg", ".Eh", ".Ej", ".Ep", ".Eq", ".Es", ".Et", ".Eu", ".Ev", ".Ey", 	// 0090 °È°É°Ê°Ë°Ì°Í°Î°Ï°Ð°Ñ
".Ez", ".E{", ".F",  ".Fd", ".Fh", ".Fp", ".Fq", ".Fs", ".Ft", ".Fu", 	// 0100 °Ò°Ó°Ô°Õ°Ö°×°Ø°Ù°Ú°Û
".G",  ".Ga", ".Gb", ".Gd", ".Gg", ".Gh", ".Gp", ".Gq", ".Gs", ".Gt", 	// 0110 °Ü°Ý°Þ°ß°à°á°â°ã°ä°å
".Gu", ".Gy", ".H",  ".Hd", ".Hh", ".Hq", ".Hs", ".I",  ".Ia", ".Id", 	// 0120 °æ°ç°è°é°ê°ë°ì°í°î°ï
".Ig", ".Ih", ".Ij", ".Il", ".Io", ".Ip", ".Iq", ".Is", ".Iu", ".Iv", 	// 0130 °ð°ñ°ò°ó°ô°õ°ö°÷°ø°ù
".J",  ".Ja", ".Jd", ".Jh", ".Jj", ".Jp", ".Jq", ".Js", ".Ju", ".K",  	// 0140 °ú°û°ü°ý°þ±¡±¢±£±¤±¥
".Kd", ".Kh", ".Kq", ".Kt", ".Ku", ".L",  ".La", ".Ld", ".Lh", ".Lp", 	// 0150 ±¦±§±¨±©±ª±«±¬±­±®±¯
".Lq", ".Ls", ".Lu", ".M",  ".Md", ".Mh", ".Mq", ".Ms", ".N",  ".Na", 	// 0160 ±°±±±²±³±´±µ±¶±·±¸±¹
".Nd", ".Ng", ".Nh", ".Ni", ".Nj", ".No", ".Np", ".Nq", ".Ns", ".Nu", 	// 0170 ±º±»±¼±½±¾±¿±À±Á±Â±Ã
".Nv", ".O",  ".Oa", ".Od", ".Oh", ".Ot", ".Ou", ".P",  ".Ps", ".Q",  	// 0180 ±Ä±Å±Æ±Ç±È±É±Ê±Ë±Ì±Í
".Qa", ".Qd", ".Qh", ".Qp", ".Qq", ".Qs", ".R",  ".Rd", ".Rh", ".S",  	// 0190 ±Î±Ï±Ð±Ñ±Ò±Ó±Ô±Õ±Ö±×
".Sa", ".Sd", ".Sg", ".Sh", ".Si", ".Sp", ".Sq", ".Ss", ".Su", ".T",  	// 0200 ±Ø±Ù±Ú±Û±Ü±Ý±Þ±ß±à±á
".U",  ".Ua", ".Ud", ".Ug", ".Uh", ".Uj", ".Up", ".Uq", ".Us", ".Uu", 	// 0210 ±â±ã±ä±å±æ±ç±è±é±ê±ë
".Uv", ".Uz", "/A",  "/Aa", "/Ab", "/Ad", "/Ah", "/Aj", "/Ap", "/Aq", 	// 0220 ±ì±í±î±ï±ð±ñ±ò±ó±ô±õ
"/As", "/At", "/Au", "/Ay", "/B",  "/Ba", "/Bd", "/Bh", "/Bp", "/Bq", 	// 0230 ±ö±÷±ø±ù±ú±û±ü±ý±þ²¡
"/Bs", "/Bt", "/Bu", "/C",  "/Ca", "/Ch", "/E",  "/Ea", "/Eb", "/Ed", 	// 0240 ²¢²£²¤²¥²¦²§²¨²©²ª²«
"/Eh", "/Ep", "/Eq", "/Es", "/Et", "/Eu", "/F",  "/Fa", "/Fd", "/Fp", 	// 0250 ²¬²­²®²¯²°²±²²²³²´²µ
"/Fs", "/Fu", "/G",  "/Gd", "/Gh", "/Gs", "/Gt", "/Gy", "/H",  "/I",  	// 0260 ²¶²·²¸²¹²º²»²¼²½²¾²¿
"/Ia", "/Id", "/If", "/Ih", "/Ip", "/Iq", "/Is", "/Iu", "/Iv", "/Iw", 	// 0270 ²À²Á²Â²Ã²Ä²Å²Æ²Ç²È²É
"/J",  "/Ja", "/Jh", "/Jt", "/Ju", "/K",  "/Ka", "/Ku", "/L",  "/Ld", 	// 0280 ²Ê²Ë²Ì²Í²Î²Ï²Ð²Ñ²Ò²Ó
"/Lh", "/Lp", "/Lq", "/Lu", "/M",  "/N",  "/Na", "/Nd", "/Nh", "/No", 	// 0290 ²Ô²Õ²Ö²×²Ø²Ù²Ú²Û²Ü²Ý
"/Np", "/Nq", "/Ns", "/Nu", "/Nv", "/O",  "/Oh", "/Ot", "/Ou", "/P",  	// 0300 ²Þ²ß²à²á²â²ã²ä²å²æ²ç
"/Pa", "/Pd", "/Ph", "/Pp", "/Pq", "/Pt", "/Q",  "/Qd", "/Qh", "/Qp", 	// 0310 ²è²é²ê²ë²ì²í²î²ï²ð²ñ
"/Qq", "/R",  "/S",  "/Sa", "/Sd", "/Sf", "/Sh", "/Sj", "/So", "/Sp", 	// 0320 ²ò²ó²ô²õ²ö²÷²ø²ù²ú²û
"/Sq", "/Ss", "/Su", "/Sy", "/U",  "/Ua", "/Ud", "/Uh", "/Up", "/Uq", 	// 0330 ²ü²ý²þ³¡³¢³£³¤³¥³¦³§
"/Us", "/Uu", "0A",  "0Aa", "0Ab", "0Ad", "0Ag", "0Ah", "0Ai", "0Aj", 	// 0340 ³¨³©³ª³«³¬³­³®³¯³°³±
"0Ap", "0Aq", "0As", "0At", "0Au", "0Av", "0Aw", "0Ay", "0A{", "0B",  	// 0350 ³²³³³´³µ³¶³·³¸³¹³º³»
"0Ba", "0Bd", "0Bh", "0Bp", "0Bq", "0Bs", "0Bt", "0Bu", "0C",  "0Ca", 	// 0360 ³¼³½³¾³¿³À³Á³Â³Ã³Ä³Å
"0Cd", "0Ch", "0Cp", "0Cu", "0E",  "0Ea", "0Ec", "0Ed", "0Eh", "0Ej", 	// 0370 ³Æ³Ç³È³É³Ê³Ë³Ì³Í³Î³Ï
"0Ek", "0Ep", "0Eq", "0Es", "0Et", "0Eu", "0E{", "0F",  "0Fa", "0Fd", 	// 0380 ³Ð³Ñ³Ò³Ó³Ô³Õ³Ö³×³Ø³Ù
"0Fh", "0Fp", "0Fq", "0Fs", "0Ft", "0Fu", "0G",  "0Ga", "0Gd", "0Gh", 	// 0390 ³Ú³Û³Ü³Ý³Þ³ß³à³á³â³ã
"0Gp", "0Gq", "0Gt", "0Gu", "0Gx", "0H",  "0Hd", "0I",  "0Ia", "0Id", 	// 0400 ³ä³å³æ³ç³è³é³ê³ë³ì³í
"0Ih", "0Ij", "0Ip", "0Iq", "0Is", "0Iu", "0Iz", "0I{", "0J",  "0Jd", 	// 0410 ³î³ï³ð³ñ³ò³ó³ô³õ³ö³÷
"0Jh", "0Jt", "0L",  "0Ld", "0Lh", "0Lp", "0Lq", "0Ls", "0M",  "0Ma", 	// 0420 ³ø³ù³ú³û³ü³ý³þ´¡´¢´£
"0Md", "0Mh", "0Mq", "0Ms", "0Mu", "0N",  "0Na", "0Nd", "0Ng", "0Nh", 	// 0430 ´¤´¥´¦´§´¨´©´ª´«´¬´­
"0Np", "0Nq", "0Ns", "0Nu", "0O",  "0Ot", "0P",  "0Q",  "0Qd", "0Qh", 	// 0440 ´®´¯´°´±´²´³´´´µ´¶´·
"0Qp", "0Qq", "0R",  "0Ra", "0Rh", "0Rp", "0Rq", "0Ru", "0S",  "0Sa", 	// 0450 ´¸´¹´º´»´¼´½´¾´¿´À´Á
"0Sd", "0Sh", "0Si", "0Sj", "0Sp", "0Sq", "0Ss", "0Su", "0Sv", "0Sz", 	// 0460 ´Â´Ã´Ä´Å´Æ´Ç´È´É´Ê´Ë
"0T",  "0Td", "0Th", "0U",  "0Ua", "0Ud", "0Uh", "0Uj", "0Up", "0Uq", 	// 0470 ´Ì´Í´Î´Ï´Ð´Ñ´Ò´Ó´Ô´Õ
"0Us", "0Uu", "0Uz", "1A",  "1Aa", "1Ab", "1Ad", "1Ag", "1Ah", "1Ai", 	// 0480 ´Ö´×´Ø´Ù´Ú´Û´Ü´Ý´Þ´ß
"1Aj", "1Ak", "1Ao", "1Ap", "1Aq", "1As", "1At", "1Au", "1Av", "1Aw", 	// 0490 ´à´á´â´ã´ä´å´æ´ç´è´é
"1A{", "1B",  "1Ba", "1Bd", "1Bh", "1Bp", "1Bq", "1Bs", "1Bt", "1Bu", 	// 0500 ´ê´ë´ì´í´î´ï´ð´ñ´ò´ó
"1C",  "1E",  "1Ea", "1Eb", "1Ed", "1Eg", "1Eh", "1Ej", "1Ek", "1Ep", 	// 0510 ´ô´õ´ö´÷´ø´ù´ú´û´ü´ý
"1Eq", "1Es", "1Eu", "1Ew", "1Ez", "1F",  "1Fa", "1Fd", "1Fh", "1Fp", 	// 0520 ´þµ¡µ¢µ£µ¤µ¥µ¦µ§µ¨µ©
"1Fq", "1Fs", "1Ft", "1Fu", "1G",  "1Gd", "1Gh", "1Gt", "1Gu", "1H",  	// 0530 µªµ«µ¬µ­µ®µ¯µ°µ±µ²µ³
"1Hd", "1I",  "1Ia", "1Id", "1Ig", "1Ih", "1Ij", "1Il", "1Ip", "1Iq", 	// 0540 µ´µµµ¶µ·µ¸µ¹µºµ»µ¼µ½
"1Is", "1Iu", "1Iw", "1Iy", "1J",  "1Jd", "1Jh", "1K",  "1Kt", "1L",  	// 0550 µ¾µ¿µÀµÁµÂµÃµÄµÅµÆµÇ
"1Ld", "1Lh", "1Lp", "1Lq", "1Ls", "1M",  "1N",  "1Na", "1Nd", "1Nh", 	// 0560 µÈµÉµÊµËµÌµÍµÎµÏµÐµÑ
"1Np", "1Nq", "1Ns", "1Nu", "1O",  "1Ot", "1P",  "1Pu", "1Q",  "1Qd", 	// 0570 µÒµÓµÔµÕµÖµ×µØµÙµÚµÛ
"1Qh", "1Qq", "1Qs", "1Qu", "1R",  "1Rd", "1Rh", "1Rp", "1Ru", "1S",  	// 0580 µÜµÝµÞµßµàµáµâµãµäµå
"1Sa", "1Sd", "1Sg", "1Sh", "1Sj", "1Sp", "1Sq", "1Ss", "1Su", "1T",  	// 0590 µæµçµèµéµêµëµìµíµîµï
"1U",  "1Ua", "1Ud", "1Ug", "1Uh", "1Up", "1Uq", "1Us", "1Ut", "1Uu", 	// 0600 µðµñµòµóµôµõµöµ÷µøµù
"1Uv", "2A",  "2Aa", "2Ad", "2Ah", "2Ap", "2Aq", "2As", "2At", "2Au", 	// 0610 µúµûµüµýµþ¶¡¶¢¶£¶¤¶¥
"2A{", "2B",  "2Ba", "2Bd", "2Bh", "2Bp", "2Bq", "2Bs", "2Bt", "2Bu", 	// 0620 ¶¦¶§¶¨¶©¶ª¶«¶¬¶­¶®¶¯
"2E",  "2Ea", "2Ed", "2Eh", "2Ej", "2Ek", "2Ep", "2Eq", "2Es", "2Et", 	// 0630 ¶°¶±¶²¶³¶´¶µ¶¶¶·¶¸¶¹
"2Eu", "2E{", "2F",  "2Fa", "2Fd", "2Fh", "2Fp", "2Fq", "2Fs", "2Ft", 	// 0640 ¶º¶»¶¼¶½¶¾¶¿¶À¶Á¶Â¶Ã
"2Fu", "2G",  "2Gt", "2I",  "2Ia", "2Id", "2Ih", "2Iu", "2J",  "2Jh", 	// 0650 ¶Ä¶Å¶Æ¶Ç¶È¶É¶Ê¶Ë¶Ì¶Í
"2K",  "2L",  "2Ld", "2N",  "2Na", "2Nd", "2Nh", "2No", "2Np", "2Nu", 	// 0660 ¶Î¶Ï¶Ð¶Ñ¶Ò¶Ó¶Ô¶Õ¶Ö¶×
"2P",  "2Q",  "2Qd", "2Qh", "2Qp", "2Qq", "2Qu", "2S",  "2Sa", "2Sd", 	// 0670 ¶Ø¶Ù¶Ú¶Û¶Ü¶Ý¶Þ¶ß¶à¶á
"2Sg", "2Sh", "2Sp", "2Sq", "2Ss", "2T",  "2Td", "2Th", "2Tp", "2Tq", 	// 0680 ¶â¶ã¶ä¶å¶æ¶ç¶è¶é¶ê¶ë
"2U",  "2Ud", "2Uh", "2Up", "2Uq", "2Us", "2Uu", "3A",  "3Aa", "3Ad", 	// 0690 ¶ì¶í¶î¶ï¶ð¶ñ¶ò¶ó¶ô¶õ
"3Ah", "3Ap", "3Aq", "3As", "3At", "3Au", "3Av", "3Az", "3A{", "3B",  	// 0700 ¶ö¶÷¶ø¶ù¶ú¶û¶ü¶ý¶þ·¡
"3Ba", "3Bd", "3Bh", "3Bp", "3Bq", "3Bs", "3Bt", "3Bu", "3C",  "3Ca", 	// 0710 ·¢·£·¤·¥·¦·§·¨·©·ª·«
"3Cd", "3Cs", "3Cu", "3E",  "3Ea", "3Ed", "3Eh", "3Ep", "3Eq", "3Es", 	// 0720 ·¬·­·®·¯·°·±·²·³·´·µ
"3Et", "3Eu", "3E{", "3F",  "3Fa", "3Fd", "3Fh", "3Fp", "3Fq", "3Fs", 	// 0730 ·¶···¸·¹·º·»·¼·½·¾·¿
"3Fu", "3G",  "3Ga", "3Gd", "3Gh", "3Gp", "3Gq", "3Gs", "3Gt", "3Gu", 	// 0740 ·À·Á·Â·Ã·Ä·Å·Æ·Ç·È·É
"3H",  "3Hd", "3Hq", "3Hs", "3I",  "3Ia", "3Id", "3Ih", "3Ip", "3Iq", 	// 0750 ·Ê·Ë·Ì·Í·Î·Ï·Ð·Ñ·Ò·Ó
"3Is", "3Iu", "3J",  "3Jd", "3Ju", "3Kt", "3L",  "3Ld", "3Lh", "3Lp", 	// 0760 ·Ô·Õ·Ö·×·Ø·Ù·Ú·Û·Ü·Ý
"3Lq", "3Ls", "3Lu", "3M",  "3Md", "3Mh", "3Mq", "3Ms", "3Mu", "3N",  	// 0770 ·Þ·ß·à·á·â·ã·ä·å·æ·ç
"3Na", "3Nd", "3Nh", "3Np", "3Nq", "3Ns", "3Nu", "3O",  "3Ot", "3P",  	// 0780 ·è·é·ê·ë·ì·í·î·ï·ð·ñ
"3Q",  "3Qa", "3Qd", "3Qh", "3Qp", "3Qs", "3Qu", "3R",  "3Ra", "3Rd", 	// 0790 ·ò·ó·ô·õ·ö·÷·ø·ù·ú·û
"3Rh", "3Rp", "3Rq", "3Rs", "3Ru", "3S",  "3Sa", "3Sd", "3Sh", "3Sp", 	// 0800 ·ü·ý·þ¸¡¸¢¸£¸¤¸¥¸¦¸§
"3Sq", "3Ss", "3Su", "3Sv", "3Sy", "3Sz", "3U",  "3Ua", "3Ud", "3Uh", 	// 0810 ¸¨¸©¸ª¸«¸¬¸­¸®¸¯¸°¸±
"3Up", "3Uq", "3Us", "3Uu", "4A",  "4Aa", "4Ad", "4Af", "4Ag", "4Ah", 	// 0820 ¸²¸³¸´¸µ¸¶¸·¸¸¸¹¸º¸»
"4Ai", "4Aj", "4Ap", "4Aq", "4As", "4Au", "4Av", "4Ay", "4A{", "4B",  	// 0830 ¸¼¸½¸¾¸¿¸À¸Á¸Â¸Ã¸Ä¸Å
"4Ba", "4Bd", "4Bh", "4Bp", "4Bq", "4Bs", "4Bt", "4Bu", "4Bv", "4C",  	// 0840 ¸Æ¸Ç¸È¸É¸Ê¸Ë¸Ì¸Í¸Î¸Ï
"4Ca", "4Ch", "4Cu", "4E",  "4Ea", "4Ed", "4Eh", "4Ej", "4Ep", "4Eq", 	// 0850 ¸Ð¸Ñ¸Ò¸Ó¸Ô¸Õ¸Ö¸×¸Ø¸Ù
"4Es", "4Eu", "4Ev", "4E{", "4F",  "4Fa", "4Fd", "4Fh", "4Fp", "4Fq", 	// 0860 ¸Ú¸Û¸Ü¸Ý¸Þ¸ß¸à¸á¸â¸ã
"4Fs", "4Ft", "4Fu", "4G",  "4Ga", "4Gd", "4Gh", "4Gs", "4Gt", "4Gu", 	// 0870 ¸ä¸å¸æ¸ç¸è¸é¸ê¸ë¸ì¸í
"4Gw", "4H",  "4I",  "4Ia", "4Ic", "4Id", "4Ih", "4Ij", "4Ip", "4Iq", 	// 0880 ¸î¸ï¸ð¸ñ¸ò¸ó¸ô¸õ¸ö¸÷
"4Is", "4Iu", "4J",  "4Jd", "4Jt", "4Ju", "4L",  "4Ld", "4Lh", "4Lq", 	// 0890 ¸ø¸ù¸ú¸û¸ü¸ý¸þ¹¡¹¢¹£
"4Ls", "4Lu", "4M",  "4Md", "4Mh", "4Mq", "4Ms", "4N",  "4Na", "4Nb", 	// 0900 ¹¤¹¥¹¦¹§¹¨¹©¹ª¹«¹¬¹­
"4Nd", "4Ng", "4Nh", "4Ni", "4Nj", "4Np", "4Nq", "4Ns", "4Nu", "4Ny", 	// 0910 ¹®¹¯¹°¹±¹²¹³¹´¹µ¹¶¹·
"4N{", "4O",  "4Od", "4Oh", "4Oq", "4Os", "4P",  "4Q",  "4Qd", "4Qh", 	// 0920 ¹¸¹¹¹º¹»¹¼¹½¹¾¹¿¹À¹Á
"4R",  "4Rd", "4Rh", "4Rp", "4Rs", "4S",  "4Sd", "4Sh", "4Sp", "4Ss", 	// 0930 ¹Â¹Ã¹Ä¹Å¹Æ¹Ç¹È¹É¹Ê¹Ë
"4U",  "4Ua", "4Ud", "4Ug", "4Uh", "4Uj", "4Up", "4Uq", "4Us", "4Ut", 	// 0940 ¹Ì¹Í¹Î¹Ï¹Ð¹Ñ¹Ò¹Ó¹Ô¹Õ
"4Uu", "4Uw", "4Uy", "5A",  "5Aa", "5Ab", "5Ac", "5Ad", "5Ag", "5Ah", 	// 0950 ¹Ö¹×¹Ø¹Ù¹Ú¹Û¹Ü¹Ý¹Þ¹ß
"5Ai", "5Aj", "5Ak", "5Ap", "5Aq", "5As", "5Au", "5Ay", "5B",  "5Ba", 	// 0960 ¹à¹á¹â¹ã¹ä¹å¹æ¹ç¹è¹é
"5Bd", "5Bh", "5Bp", "5Bq", "5Bs", "5Bt", "5Bu", "5By", "5C",  "5Ca", 	// 0970 ¹ê¹ë¹ì¹í¹î¹ï¹ð¹ñ¹ò¹ó
"5Cd", "5Cq", "5E",  "5Ea", "5Ed", "5Eg", "5Eh", "5Ej", "5Ep", "5Eq", 	// 0980 ¹ô¹õ¹ö¹÷¹ø¹ù¹ú¹û¹ü¹ý
"5Es", "5Eu", "5Ev", "5F",  "5Fa", "5Fd", "5Fg", "5Fh", "5Fp", "5Fq", 	// 0990 ¹þº¡º¢º£º¤º¥º¦º§º¨º©
"5Fs", "5Ft", "5Fu", "5G",  "5Ga", "5Gd", "5Gh", "5Gq", "5Gs", "5Gt", 	// 1000 ºªº«º¬º­º®º¯º°º±º²º³
"5Gu", "5Gy", "5H",  "5Hd", "5I",  "5Ia", "5Ib", "5Id", "5Ih", "5Ip", 	// 1010 º´ºµº¶º·º¸º¹ººº»º¼º½
"5Iq", "5Is", "5Iu", "5J",  "5Jd", "5Jt", "5K",  "5Kt", "5L",  "5La", 	// 1020 º¾º¿ºÀºÁºÂºÃºÄºÅºÆºÇ
"5Ld", "5Lh", "5Lp", "5Lq", "5M",  "5Md", "5N",  "5Na", "5Nd", "5Ng", 	// 1030 ºÈºÉºÊºËºÌºÍºÎºÏºÐºÑ
"5Nh", "5Ni", "5Nj", "5Np", "5Nq", "5Ns", "5Nu", "5Ny", "5Nz", "5O",  	// 1040 ºÒºÓºÔºÕºÖº×ºØºÙºÚºÛ
"5Oh", "5Ot", "5P",  "5Q",  "5Qa", "5Qd", "5Qh", "5Qu", "5R",  "5Rd", 	// 1050 ºÜºÝºÞºßºàºáºâºãºäºå
"5Rh", "5Rp", "5Rs", "5Ru", "5S",  "5Sa", "5Sd", "5Sh", "5Sp", "5Sq", 	// 1060 ºæºçºèºéºêºëºìºíºîºï
"5Ss", "5U",  "5Ua", "5Ud", "5Uh", "5Uj", "5Up", "5Uq", "5Us", "5Uu", 	// 1070 ºðºñºòºóºôºõºöº÷ºøºù
"5Uv", "5Uw", "6A",  "6Aa", "6Ad", "6Ah", "6Aj", "6Ap", "6Aq", "6As", 	// 1080 ºúºûºüºýºþ»¡»¢»£»¤»¥
"6At", "6Au", "6A{", "6B",  "6Ba", "6Bd", "6Bh", "6Bp", "6Bq", "6Bs", 	// 1090 »¦»§»¨»©»ª»«»¬»­»®»¯
"6Bt", "6Bu", "6C",  "6Ca", "6Cp", "6E",  "6Ea", "6Ed", "6Eg", "6Eh", 	// 1100 »°»±»²»³»´»µ»¶»·»¸»¹
"6Ep", "6Es", "6Et", "6Eu", "6F",  "6Fu", "6G",  "6Ga", "6Gp", "6Gq", 	// 1110 »º»»»¼»½»¾»¿»À»Á»Â»Ã
"6Gs", "6Gt", "6Gu", "6I",  "6Ia", "6Id", "6Ih", "6Ip", "6Iq", "6Iu", 	// 1120 »Ä»Å»Æ»Ç»È»É»Ê»Ë»Ì»Í
"6L",  "6M",  "6Mu", "6N",  "6Na", "6Nd", "6Nh", "6Np", "6Ns", "6Nu", 	// 1130 »Î»Ï»Ð»Ñ»Ò»Ó»Ô»Õ»Ö»×
"6R",  "6Ru", "6S",  "6Sd", "6Sh", "6Sp", "6Sq", "6U",  "6Ua", "6Ud", 	// 1140 »Ø»Ù»Ú»Û»Ü»Ý»Þ»ß»à»á
"6Uh", "6Up", "6Uq", "6Us", "6Uu", "7A",  "7Aa", "7Ac", "7Ad", "7Ag", 	// 1150 »â»ã»ä»å»æ»ç»è»é»ê»ë
"7Ah", "7Ai", "7Aj", "7Ap", "7Aq", "7As", "7At", "7Au", "7Ay", "7B",  	// 1160 »ì»í»î»ï»ð»ñ»ò»ó»ô»õ
"7Ba", "7Bd", "7Bh", "7Bp", "7Bq", "7Bs", "7Bt", "7Bu", "7C",  "7Ca", 	// 1170 »ö»÷»ø»ù»ú»û»ü»ý»þ¼¡
"7Cd", "7Ch", "7Cp", "7Cq", "7Cs", "7Cu", "7D",  "7Dd", "7Dh", "7Dp", 	// 1180 ¼¢¼£¼¤¼¥¼¦¼§¼¨¼©¼ª¼«
"7Du", "7E",  "7Ea", "7Eb", "7Ec", "7Ed", "7Eg", "7Eh", "7Ej", "7Ek", 	// 1190 ¼¬¼­¼®¼¯¼°¼±¼²¼³¼´¼µ
"7Ep", "7Eq", "7Es", "7Et", "7Eu", "7Ez", "7F",  "7Fa", "7Fd", "7Fh", 	// 1200 ¼¶¼·¼¸¼¹¼º¼»¼¼¼½¼¾¼¿
"7Fp", "7Fq", "7Fs", "7Ft", "7Fu", "7G",  "7Ga", "7Gd", "7Gh", "7Gp", 	// 1210 ¼À¼Á¼Â¼Ã¼Ä¼Å¼Æ¼Ç¼È¼É
"7Gq", "7Gs", "7Gt", "7Gu", "7H",  "7Hd", "7Hh", "7Hu", "7I",  "7Ia", 	// 1220 ¼Ê¼Ë¼Ì¼Í¼Î¼Ï¼Ð¼Ñ¼Ò¼Ó
"7Ib", "7Id", "7Ih", "7Ij", "7Ip", "7Iq", "7Is", "7Iu", "7Iy", "7J",  	// 1230 ¼Ô¼Õ¼Ö¼×¼Ø¼Ù¼Ú¼Û¼Ü¼Ý
"7Ja", "7Jd", "7Jh", "7Ju", "7K",  "7Kd", "7Kh", "7Kp", "7Ks", "7Kt", 	// 1240 ¼Þ¼ß¼à¼á¼â¼ã¼ä¼å¼æ¼ç
"7L",  "7Ld", "7Lh", "7Lp", "7Lq", "7Ls", "7M",  "7Ma", "7Md", "7Mh", 	// 1250 ¼è¼é¼ê¼ë¼ì¼í¼î¼ï¼ð¼ñ
"7Mp", "7Mq", "7Ms", "7Mu", "7N",  "7Na", "7Nd", "7Ng", "7Nh", "7Np", 	// 1260 ¼ò¼ó¼ô¼õ¼ö¼÷¼ø¼ù¼ú¼û
"7Nq", "7Ns", "7Nu", "7Nw", "7Ny", "7Nz", "7O",  "7Ot", "7P",  "7Pa", 	// 1270 ¼ü¼ý¼þ½¡½¢½£½¤½¥½¦½§
"7Pd", "7Ph", "7Pp", "7Pu", "7Q",  "7Qa", "7Qd", "7Qh", "7Qp", "7Qq", 	// 1280 ½¨½©½ª½«½¬½­½®½¯½°½±
"7Qs", "7Qu", "7R",  "7Ra", "7Rh", "7Rp", "7Rs", "7Ru", "7S",  "7Sa", 	// 1290 ½²½³½´½µ½¶½·½¸½¹½º½»
"7Sd", "7Sh", "7Si", "7Sp", "7Sq", "7Ss", "7Su", "7U",  "7Ua", "7Ud", 	// 1300 ½¼½½½¾½¿½À½Á½Â½Ã½Ä½Å
"7Ug", "7Uh", "7Uo", "7Up", "7Uq", "7Us", "7Uu", "7Uz", "8A",  "8Aa", 	// 1310 ½Æ½Ç½È½É½Ê½Ë½Ì½Í½Î½Ï
"8Ac", "8Ad", "8Ah", "8Ap", "8Aq", "8At", "8Au", "8A{", "8B",  "8Ba", 	// 1320 ½Ð½Ñ½Ò½Ó½Ô½Õ½Ö½×½Ø½Ù
"8Bd", "8Bh", "8Bp", "8Bq", "8Bt", "8Bu", "8Cu", "8E",  "8Ea", "8Ed", 	// 1330 ½Ú½Û½Ü½Ý½Þ½ß½à½á½â½ã
"8Eh", "8Ej", "8Ep", "8Eq", "8Et", "8Eu", "8F",  "8Fd", "8Fh", "8Hd", 	// 1340 ½ä½å½æ½ç½è½é½ê½ë½ì½í
"8I",  "8Ia", "8Id", "8Ig", "8Ih", "8Ij", "8Ip", "8Iq", "8Iu", "8J",  	// 1350 ½î½ï½ð½ñ½ò½ó½ô½õ½ö½÷
"8Ja", "8Jd", "8Jt", "8K",  "8Kt", "8L",  "8Ld", "8Lh", "8Lp", "8Lq", 	// 1360 ½ø½ù½ú½û½ü½ý½þ¾¡¾¢¾£
"8M",  "8N",  "8Na", "8Nd", "8Nh", "8Np", "8Nq", "8Nu", "8O",  "8Ot", 	// 1370 ¾¤¾¥¾¦¾§¾¨¾©¾ª¾«¾¬¾­
"8P",  "8Q",  "8Qd", "8Ru", "8S",  "8Sa", "8Sd", "8Sh", "8Sj", "8So", 	// 1380 ¾®¾¯¾°¾±¾²¾³¾´¾µ¾¶¾·
"8Sp", "8Sq", "8T",  "8Td", "8Th", "8Tp", "8U",  "8Ua", "8Ud", "8Uh", 	// 1390 ¾¸¾¹¾º¾»¾¼¾½¾¾¾¿¾À¾Á
"8Up", "8Uq", "8Us", "8Uu", "9A",  "9Aa", "9Ad", "9Ae", "9Af", "9Ah", 	// 1400 ¾Â¾Ã¾Ä¾Å¾Æ¾Ç¾È¾É¾Ê¾Ë
"9Ai", "9Aj", "9Ao", "9Ap", "9Aq", "9As", "9At", "9Au", "9Ay", "9Az", 	// 1410 ¾Ì¾Í¾Î¾Ï¾Ð¾Ñ¾Ò¾Ó¾Ô¾Õ
"9B",  "9Ba", "9Bd", "9Bh", "9Bp", "9Bq", "9Bs", "9Bt", "9Bu", "9C",  	// 1420 ¾Ö¾×¾Ø¾Ù¾Ú¾Û¾Ü¾Ý¾Þ¾ß
"9Ca", "9Cd", "9Ch", "9Ck", "9Cp", "9Cq", "9Cs", "9Cu", "9Cy", "9C{", 	// 1430 ¾à¾á¾â¾ã¾ä¾å¾æ¾ç¾è¾é
"9D",  "9Dd", "9Dh", "9Dq", "9E",  "9Ea", "9Ed", "9Ee", "9Eg", "9Eh", 	// 1440 ¾ê¾ë¾ì¾í¾î¾ï¾ð¾ñ¾ò¾ó
"9Ei", "9Ej", "9Ep", "9Eq", "9Er", "9Es", "9Et", "9Eu", "9Ev", "9Ex", 	// 1450 ¾ô¾õ¾ö¾÷¾ø¾ù¾ú¾û¾ü¾ý
"9Ez", "9F",  "9Fa", "9Fd", "9Fh", "9Fp", "9Fq", "9Fs", "9Fu", "9G",  	// 1460 ¾þ¿¡¿¢¿£¿¤¿¥¿¦¿§¿¨¿©
"9Ga", "9Gb", "9Gd", "9Gh", "9Gj", "9Gk", "9Gp", "9Gq", "9Gr", "9Gs", 	// 1470 ¿ª¿«¿¬¿­¿®¿¯¿°¿±¿²¿³
"9Gt", "9Gu", "9Gy", "9Gz", "9G{", "9H",  "9Hd", "9Hh", "9Hp", "9Hq", 	// 1480 ¿´¿µ¿¶¿·¿¸¿¹¿º¿»¿¼¿½
"9Hs", "9Ht", "9I",  "9Ia", "9Id", "9Ih", "9Ii", "9Ij", "9Il", "9Io", 	// 1490 ¿¾¿¿¿À¿Á¿Â¿Ã¿Ä¿Å¿Æ¿Ç
"9Ip", "9Iq", "9Is", "9Iu", "9Iw", "9J",  "9Ja", "9Jd", "9Jh", "9Jp", 	// 1500 ¿È¿É¿Ê¿Ë¿Ì¿Í¿Î¿Ï¿Ð¿Ñ
"9Jq", "9Js", "9Jt", "9Ju", "9K",  "9Ka", "9Kd", "9Kp", "9Ks", "9Ku", 	// 1510 ¿Ò¿Ó¿Ô¿Õ¿Ö¿×¿Ø¿Ù¿Ú¿Û
"9L",  "9La", "9Ld", "9Lh", "9Lp", "9Lq", "9Ls", "9Lu", "9M",  "9Ma", 	// 1520 ¿Ü¿Ý¿Þ¿ß¿à¿á¿â¿ã¿ä¿å
"9Md", "9Mh", "9Mp", "9Mq", "9Ms", "9Mu", "9N",  "9Na", "9Nd", "9Nh", 	// 1530 ¿æ¿ç¿è¿é¿ê¿ë¿ì¿í¿î¿ï
"9Ni", "9Nj", "9Np", "9Nq", "9Ns", "9Nu", "9O",  "9Oa", "9Od", "9Oh", 	// 1540 ¿ð¿ñ¿ò¿ó¿ô¿õ¿ö¿÷¿ø¿ù
"9Op", "9Oq", "9Ot", "9Ou", "9P",  "9Pa", "9Pd", "9Ph", "9Pp", "9Pq", 	// 1550 ¿ú¿û¿ü¿ý¿þÀ¡À¢À£À¤À¥
"9Pu", "9Q",  "9Qa", "9Qd", "9Qh", "9Qp", "9Qq", "9Qs", "9Qu", "9R",  	// 1560 À¦À§À¨À©ÀªÀ«À¬À­À®À¯
"9Ra", "9Rd", "9Rh", "9Rp", "9Rq", "9Rs", "9Ru", "9Rw", "9S",  "9Sa", 	// 1570 À°À±À²À³À´ÀµÀ¶À·À¸À¹
"9Sd", "9Sh", "9Sn", "9Sp", "9Sq", "9Ss", "9Su", "9Sv", "9Sw", "9Sx", 	// 1580 ÀºÀ»À¼À½À¾À¿ÀÀÀÁÀÂÀÃ
"9Sy", "9Sz", "9S{", "9T",  "9Td", "9Th", "9Tp", "9Ts", "9U",  "9Ua", 	// 1590 ÀÄÀÅÀÆÀÇÀÈÀÉÀÊÀËÀÌÀÍ
"9Ud", "9Uh", "9Ui", "9Uj", "9Uo", "9Up", "9Uq", "9Us", "9Ut", "9Uu", 	// 1600 ÀÎÀÏÀÐÀÑÀÒÀÓÀÔÀÕÀÖÀ×
"9Uv", "9Uz", ":A",  ":Aa", ":Ad", ":Af", ":Ag", ":Ah", ":Aj", ":Ap", 	// 1610 ÀØÀÙÀÚÀÛÀÜÀÝÀÞÀßÀàÀá
":Aq", ":As", ":At", ":Au", ":Av", ":B",  ":Ba", ":Bd", ":Bh", ":Bp", 	// 1620 ÀâÀãÀäÀåÀæÀçÀèÀéÀêÀë
":Bq", ":Bs", ":Bt", ":Bu", ":C",  ":Ca", ":Cd", ":Cf", ":Ch", ":Cp", 	// 1630 ÀìÀíÀîÀïÀðÀñÀòÀóÀôÀõ
":Cu", ":D",  ":Dd", ":Dh", ":E",  ":Ea", ":Ed", ":Eh", ":Ej", ":Ep", 	// 1640 ÀöÀ÷ÀøÀùÀúÀûÀüÀýÀþÁ¡
":Eq", ":Es", ":Eu", ":Ev", ":F",  ":Fa", ":Fd", ":Fh", ":Fp", ":Fq", 	// 1650 Á¢Á£Á¤Á¥Á¦Á§Á¨Á©ÁªÁ«
":Fs", ":Fu", ":G",  ":Gd", ":Gh", ":Gp", ":Gq", ":Gt", ":Gu", ":H",  	// 1660 Á¬Á­Á®Á¯Á°Á±Á²Á³Á´Áµ
":I",  ":Ia", ":Id", ":Ih", ":Ij", ":Ip", ":Iq", ":Is", ":Iu", ":Iv", 	// 1670 Á¶Á·Á¸Á¹ÁºÁ»Á¼Á½Á¾Á¿
":Iw", ":I{", ":J",  ":Ja", ":Jh", ":Jq", ":Js", ":Ju", ":K",  ":Kt", 	// 1680 ÁÀÁÁÁÂÁÃÁÄÁÅÁÆÁÇÁÈÁÉ
":Ku", ":L",  ":Ld", ":Lh", ":Lp", ":Lq", ":Ls", ":Lu", ":M",  ":Ma", 	// 1690 ÁÊÁËÁÌÁÍÁÎÁÏÁÐÁÑÁÒÁÓ
":Md", ":Mu", ":N",  ":Na", ":Nd", ":Nh", ":Ni", ":Nj", ":Np", ":Nq", 	// 1700 ÁÔÁÕÁÖÁ×ÁØÁÙÁÚÁÛÁÜÁÝ
":Ns", ":Nu", ":O",  ":Ot", ":P",  ":Q",  ":Qa", ":Qd", ":Qh", ":Qp", 	// 1710 ÁÞÁßÁàÁáÁâÁãÁäÁåÁæÁç
":Qq", ":Qs", ":R",  ":Rd", ":Rh", ":Rp", ":S",  ":Sa", ":Sd", ":Sh", 	// 1720 ÁèÁéÁêÁëÁìÁíÁîÁïÁðÁñ
":Sp", ":Sq", ":Ss", ":Su", ":U",  ":Ua", ":Ud", ":Ug", ":Uh", ":Uj", 	// 1730 ÁòÁóÁôÁõÁöÁ÷ÁøÁùÁúÁû
":Up", ":Uq", ":Us", ":Uu", ":Uv", ":Uy", ":Uz", ";A",  ";Aa", ";Ad", 	// 1740 ÁüÁýÁþÂ¡Â¢Â£Â¤Â¥Â¦Â§
";Af", ";Ah", ";Ak", ";Ap", ";Aq", ";As", ";At", ";Au", ";B",  ";Ba", 	// 1750 Â¨Â©ÂªÂ«Â¬Â­Â®Â¯Â°Â±
";Bd", ";Bh", ";Bp", ";Bq", ";Bs", ";Bt", ";Bu", ";C",  ";Cd", ";Cu", 	// 1760 Â²Â³Â´ÂµÂ¶Â·Â¸Â¹ÂºÂ»
";E",  ";Ea", ";Ed", ";Eh", ";Ep", ";Eq", ";Es", ";Et", ";Eu", ";F",  	// 1770 Â¼Â½Â¾Â¿ÂÀÂÁÂÂÂÃÂÄÂÅ
";Fu", ";G",  ";Gt", ";I",  ";Ia", ";Id", ";Ih", ";Ip", ";Iq", ";Is", 	// 1780 ÂÆÂÇÂÈÂÉÂÊÂËÂÌÂÍÂÎÂÏ
";Iu", ";Iw", ";J",  ";Ja", ";Jh", ";Jt", ";K",  ";Kt", ";L",  ";Ld", 	// 1790 ÂÐÂÑÂÒÂÓÂÔÂÕÂÖÂ×ÂØÂÙ
";Lh", ";Lp", ";Lq", ";Mu", ";N",  ";Na", ";Nd", ";Nh", ";Np", ";Nq", 	// 1800 ÂÚÂÛÂÜÂÝÂÞÂßÂàÂáÂâÂã
";Nu", ";O",  ";Ot", ";Ou", ";Q",  ";R",  ";S",  ";Sp", ";Ss", ";Su", 	// 1810 ÂäÂåÂæÂçÂèÂéÂêÂëÂìÂí
";U",  ";Ua", ";Ud", ";Uh", ";Up", ";Uq", ";Uu", ";Uv", ";U{", "<A",  	// 1820 ÂîÂïÂðÂñÂòÂóÂôÂõÂöÂ÷
"<Aa", "<Ad", "<Af", "<Ah", "<Ap", "<Aq", "<As", "<At", "<Au", "<Av", 	// 1830 ÂøÂùÂúÂûÂüÂýÂþÃ¡Ã¢Ã£
"<B",  "<Ba", "<Bd", "<Bh", "<Bp", "<Bq", "<Bs", "<Bt", "<Bu", "<C",  	// 1840 Ã¤Ã¥Ã¦Ã§Ã¨Ã©ÃªÃ«Ã¬Ã­
"<Cd", "<Cf", "<Ch", "<Cp", "<Cu", "<E",  "<Ea", "<Ed", "<Eh", "<Ep", 	// 1850 Ã®Ã¯Ã°Ã±Ã²Ã³Ã´ÃµÃ¶Ã·
"<Eq", "<Es", "<Et", "<Eu", "<F",  "<Fa", "<Fd", "<Fh", "<Fp", "<Fq", 	// 1860 Ã¸Ã¹ÃºÃ»Ã¼Ã½Ã¾Ã¿ÃÀÃÁ
"<Fs", "<Fu", "<G",  "<Gd", "<Gt", "<H",  "<Hd", "<Hu", "<I",  "<Ia", 	// 1870 ÃÂÃÃÃÄÃÅÃÆÃÇÃÈÃÉÃÊÃË
"<Id", "<Ih", "<Ip", "<Iq", "<Is", "<Iu", "<J",  "<Jd", "<Jh", "<Ju", 	// 1880 ÃÌÃÍÃÎÃÏÃÐÃÑÃÒÃÓÃÔÃÕ
"<L",  "<Ld", "<Lh", "<Lp", "<Lq", "<Ls", "<Lu", "<M",  "<Mp", "<N",  	// 1890 ÃÖÃ×ÃØÃÙÃÚÃÛÃÜÃÝÃÞÃß
"<Na", "<Nd", "<Nh", "<Np", "<Nq", "<Ns", "<Nu", "<O",  "<Ot", "<P",  	// 1900 ÃàÃáÃâÃãÃäÃåÃæÃçÃèÃé
"<Pd", "<Q",  "<Qd", "<Qh", "<Qp", "<Qq", "<Qs", "<Qu", "<R",  "<Rd", 	// 1910 ÃêÃëÃìÃíÃîÃïÃðÃñÃòÃó
"<Rh", "<Rp", "<Ru", "<S",  "<Sa", "<Sd", "<Sh", "<Sp", "<Sq", "<Ss", 	// 1920 ÃôÃõÃöÃ÷ÃøÃùÃúÃûÃüÃý
"<Su", "<U",  "<Ua", "<Ud", "<Ug", "<Uh", "<Ui", "<Up", "<Uq", "<Us", 	// 1930 ÃþÄ¡Ä¢Ä£Ä¤Ä¥Ä¦Ä§Ä¨Ä©
"<Uu", "=A",  "=Aa", "=Ad", "=Ah", "=Ap", "=Aq", "=As", "=Au", "=B",  	// 1940 ÄªÄ«Ä¬Ä­Ä®Ä¯Ä°Ä±Ä²Ä³
"=Ba", "=Bd", "=Bh", "=Bp", "=Bq", "=Bs", "=Bt", "=Bu", "=C",  "=Ca", 	// 1950 Ä´ÄµÄ¶Ä·Ä¸Ä¹ÄºÄ»Ä¼Ä½
"=Cu", "=E",  "=Ea", "=Ed", "=Eg", "=Eh", "=Ep", "=Eq", "=Es", "=Et", 	// 1960 Ä¾Ä¿ÄÀÄÁÄÂÄÃÄÄÄÅÄÆÄÇ
"=Eu", "=F",  "=Fa", "=Fd", "=Fh", "=Fp", "=Fq", "=Fs", "=Fu", "=G",  	// 1970 ÄÈÄÉÄÊÄËÄÌÄÍÄÎÄÏÄÐÄÑ
"=Gd", "=Gh", "=Gp", "=Gq", "=Gs", "=Gt", "=Gu", "=H",  "=I",  "=Ia", 	// 1980 ÄÒÄÓÄÔÄÕÄÖÄ×ÄØÄÙÄÚÄÛ
"=Id", "=Ih", "=Ip", "=Iq", "=Is", "=Iu", "=J",  "=Ja", "=Jd", "=Jh", 	// 1990 ÄÜÄÝÄÞÄßÄàÄáÄâÄãÄäÄå
"=Jp", "=Ju", "=K",  "=Ku", "=L",  "=Lh", "=M",  "=N",  "=Na", "=Nd", 	// 2000 ÄæÄçÄèÄéÄêÄëÄìÄíÄîÄï
"=Nh", "=Np", "=Nq", "=Ns", "=Nu", "=O",  "=Od", "=Oh", "=Ou", "=P",  	// 2010 ÄðÄñÄòÄóÄôÄõÄöÄ÷ÄøÄù
"=Pu", "=Q",  "=Qa", "=Qd", "=Qh", "=Qp", "=Qq", "=Qs", "=Qu", "=R",  	// 2020 ÄúÄûÄüÄýÄþÅ¡Å¢Å£Å¤Å¥
"=Rd", "=Rh", "=Rp", "=S",  "=Sa", "=Sd", "=Sh", "=Sp", "=Sq", "=Su", 	// 2030 Å¦Å§Å¨Å©ÅªÅ«Å¬Å­Å®Å¯
"=U",  "=Ua", "=Ud", "=Uh", "=Up", "=Uq", "=Us", "=Uu", ">A",  ">Aa", 	// 2040 Å°Å±Å²Å³Å´ÅµÅ¶Å·Å¸Å¹
">Ad", ">Ah", ">Ai", ">Ap", ">Aq", ">As", ">At", ">Au", ">B",  ">Ba", 	// 2050 ÅºÅ»Å¼Å½Å¾Å¿ÅÀÅÁÅÂÅÃ
">Bd", ">Bh", ">Bp", ">Bq", ">Bs", ">Bt", ">Bu", ">C",  ">Cu", ">E",  	// 2060 ÅÄÅÅÅÆÅÇÅÈÅÉÅÊÅËÅÌÅÍ
">Ea", ">Ed", ">Eh", ">Ej", ">Ep", ">Eq", ">Es", ">Et", ">Eu", ">F",  	// 2070 ÅÎÅÏÅÐÅÑÅÒÅÓÅÔÅÕÅÖÅ×
">Fa", ">Fd", ">Fh", ">Fp", ">Fq", ">Fs", ">Fu", ">G",  ">Gd", ">Gt", 	// 2080 ÅØÅÙÅÚÅÛÅÜÅÝÅÞÅßÅàÅá
">H",  ">Hd", ">I",  ">Ia", ">Id", ">Ih", ">Ip", ">Iq", ">Is", ">Iu", 	// 2090 ÅâÅãÅäÅåÅæÅçÅèÅéÅêÅë
">Iz", ">J",  ">Jd", ">K",  ">L",  ">Ld", ">Ls", ">Lu", ">M",  ">N",  	// 2100 ÅìÅíÅîÅïÅðÅñÅòÅóÅôÅõ
">Na", ">Nd", ">Nh", ">Np", ">Nq", ">Ns", ">Nu", ">O",  ">Ot", ">P",  	// 2110 ÅöÅ÷ÅøÅùÅúÅûÅüÅýÅþÆ¡
">Q",  ">Qa", ">Qd", ">Qh", ">Qp", ">Qq", ">Qu", ">R",  ">Rd", ">Rh", 	// 2120 Æ¢Æ£Æ¤Æ¥Æ¦Æ§Æ¨Æ©ÆªÆ«
">Rp", ">Ru", ">S",  ">Sa", ">Sd", ">Sg", ">Sh", ">Sj", ">Sp", ">Sq", 	// 2130 Æ¬Æ­Æ®Æ¯Æ°Æ±Æ²Æ³Æ´Æµ
">Ss", ">T",  ">Td", ">Th", ">Tp", ">Tq", ">U",  ">Ua", ">Ud", ">Uh", 	// 2140 Æ¶Æ·Æ¸Æ¹ÆºÆ»Æ¼Æ½Æ¾Æ¿
">Up", ">Uq", ">Us", ">Uu", "?A",  "?Aa", "?Ab", "?Ad", "?Ah", "?Aj", 	// 2150 ÆÀÆÁÆÂÆÃÆÄÆÅÆÆÆÇÆÈÆÉ
"?Ap", "?Aq", "?As", "?At", "?Au", "?Ay", "?B",  "?Ba", "?Bd", "?Bh", 	// 2160 ÆÊÆËÆÌÆÍÆÎÆÏÆÐÆÑÆÒÆÓ
"?Bp", "?Bq", "?Bs", "?Bt", "?Bu", "?C",  "?Ca", "?E",  "?Ea", "?Ed", 	// 2170 ÆÔÆÕÆÖÆ×ÆØÆÙÆÚÆÛÆÜÆÝ
"?Eh", "?Ep", "?Eq", "?Es", "?Et", "?Eu", "?F",  "?Fa", "?Fd", "?Fh", 	// 2180 ÆÞÆßÆàÆáÆâÆãÆäÆåÆæÆç
"?Fp", "?Fq", "?Fs", "?Fu", "?G",  "?Gd", "?Gh", "?Gp", "?Gq", "?Gt", 	// 2190 ÆèÆéÆêÆëÆìÆíÆîÆïÆðÆñ
"?Gu", "?H",  "?Hh", "?Hq", "?Hs", "?I",  "?Ia", "?Id", "?Ih", "?Ip", 	// 2200 ÆòÆóÆôÆõÆöÆ÷ÆøÆùÆúÆû
"?Iq", "?Is", "?Iu", "?J",  "?Ju", "?L",  "?Ld", "?M",  "?Md", "?Mh", 	// 2210 ÆüÆýÆþÇ¡Ç¢Ç£Ç¤Ç¥Ç¦Ç§
"?Mq", "?Ms", "?N",  "?Na", "?Nd", "?Ng", "?Nh", "?Nj", "?Np", "?Nq", 	// 2220 Ç¨Ç©ÇªÇ«Ç¬Ç­Ç®Ç¯Ç°Ç±
"?Ns", "?Nu", "?O",  "?Ou", "?Q",  "?Qd", "?Qh", "?Qp", "?Qs", "?R",  	// 2230 Ç²Ç³Ç´ÇµÇ¶Ç·Ç¸Ç¹ÇºÇ»
"?Rd", "?Rh", "?Rp", "?Rs", "?Ru", "?S",  "?Sd", "?Sh", "?Sp", "?Sq", 	// 2240 Ç¼Ç½Ç¾Ç¿ÇÀÇÁÇÂÇÃÇÄÇÅ
"?Ss", "?U",  "?Ua", "?Ud", "?Uh", "?Up", "?Uq", "?Us", "?Uu", "@A",  	// 2250 ÇÆÇÇÇÈÇÉÇÊÇËÇÌÇÍÇÎÇÏ
"@Aa", "@Ad", "@Ah", "@Am", "@Ap", "@Aq", "@As", "@Au", "@B",  "@Ba", 	// 2260 ÇÐÇÑÇÒÇÓÇÔÇÕÇÖÇ×ÇØÇÙ
"@Bd", "@Bh", "@Bp", "@Bq", "@Bs", "@Bt", "@Bu", "@C",  "@Cu", "@E",  	// 2270 ÇÚÇÛÇÜÇÝÇÞÇßÇàÇáÇâÇã
"@Ea", "@Ed", "@Eh", "@Ej", "@Ep", "@Eq", "@Es", "@Eu", "@F",  "@Fa", 	// 2280 ÇäÇåÇæÇçÇèÇéÇêÇëÇìÇí
"@Fd", "@Fh", "@Fp", "@Fq", "@Fs", "@Fu", "@G",  "@Ga", "@Gd", "@Gh", 	// 2290 ÇîÇïÇðÇñÇòÇóÇôÇõÇöÇ÷
"@Gp", "@Gq", "@Gs", "@Gt", "@Gu", "@H",  "@Hd", "@Hh", "@Hq", "@I",  	// 2300 ÇøÇùÇúÇûÇüÇýÇþÈ¡È¢È£
"@Ia", "@Id", "@Ih", "@Im", "@Ip", "@Iq", "@Is", "@Iu", "@Iy", "@J",  	// 2310 È¤È¥È¦È§È¨È©ÈªÈ«È¬È­
"@Ja", "@Jd", "@Jh", "@Js", "@Ju", "@K",  "@Ka", "@Kd", "@Ks", "@Ku", 	// 2320 È®È¯È°È±È²È³È´ÈµÈ¶È·
"@L",  "@La", "@Ld", "@Lh", "@Lq", "@Ls", "@Lu", "@M",  "@Md", "@Mh", 	// 2330 È¸È¹ÈºÈ»È¼È½È¾È¿ÈÀÈÁ
"@Mq", "@Ms", "@N",  "@Na", "@Nd", "@Nh", "@Nm", "@Np", "@Ns", "@Nu", 	// 2340 ÈÂÈÃÈÄÈÅÈÆÈÇÈÈÈÉÈÊÈË
"@O",  "@Od", "@Oh", "@Op", "@Ou", "@P",  "@Pa", "@Pd", "@Ph", "@Pu", 	// 2350 ÈÌÈÍÈÎÈÏÈÐÈÑÈÒÈÓÈÔÈÕ
"@Q",  "@Qa", "@Qd", "@Qh", "@Qp", "@Qq", "@Qs", "@Qu", "@R",  "@Ra", 	// 2360 ÈÖÈ×ÈØÈÙÈÚÈÛÈÜÈÝÈÞÈß
"@Rd", "@Rh", "@Rp", "@Rs", "@Ru", "@S",  "@Sa", "@Sd", "@Sf", "@Sg", 	// 2370 ÈàÈáÈâÈãÈäÈåÈæÈçÈèÈé
"@Sh", "@Si", "@Sp", "@Sq", "@Ss", "@Su", "@Sy", "@T",  "@Td", "@Th", 	// 2380 ÈêÈëÈìÈíÈîÈïÈðÈñÈòÈó
"@Tp", "@Tq", "@Tu", "@U",  "@Ua", "@Ud", "@Uh", "@Up", "@Uq", "@Us", 	// 2390 ÈôÈõÈöÈ÷ÈøÈùÈúÈûÈüÈý
"@Uu"	// 2400 Èþ
};


int t2ktbl[MAXT2K] = {
  51,   52,   53,   54,   55,   56,   57,   58,   59,   60, 	// 0000 .A .Aa .Ad .Ag .Ah .Ai .Aj .Ap .Aq .Ar 
  61,   62,   63,   64,   65,   66,   67,   68,   69,   70, 	// 0010 .As .At .Au .Av .Aw .Ay .Az .A{ .B .Ba 
  71,   72,   73,   74,   75,   76,   77,   78,   79,   80, 	// 0020 .Bd .Bh .Bp .Bq .Bs .Bt .Bu .C .Ca .Cd 
  81,   82,   83,   84,   85,   86,   87,   88,   89,   90, 	// 0030 .Ch .Cs .Cu .D .Dd .Dh .E .Ea .Ed .Eg 
  91,   92,   93,   94,   95,   96,   97,   98,   99,  100, 	// 0040 .Eh .Ej .Ep .Eq .Es .Et .Eu .Ev .Ey .Ez 
 101,  102,  103,  104,  105,  106,  107,  108,  109,  110, 	// 0050 .E{ .F .Fd .Fh .Fp .Fq .Fs .Ft .Fu .G 
 111,  112,  113,  114,  115,  116,  117,  118,  119,  120, 	// 0060 .Ga .Gb .Gd .Gg .Gh .Gp .Gq .Gs .Gt .Gu 
 121,  122,  123,  124,  125,  126,  127,  128,  129,  130, 	// 0070 .Gy .H .Hd .Hh .Hq .Hs .I .Ia .Id .Ig 
 131,  132,  133,  134,  135,  136,  137,  138,  139,  140, 	// 0080 .Ih .Ij .Il .Io .Ip .Iq .Is .Iu .Iv .J 
 141,  142,  143,  144,  145,  146,  147,  148,  149,  150, 	// 0090 .Ja .Jd .Jh .Jj .Jp .Jq .Js .Ju .K .Kd 
 151,  152,  153,  154,  155,  156,  157,  158,  159,  160, 	// 0100 .Kh .Kq .Kt .Ku .L .La .Ld .Lh .Lp .Lq 
 161,  162,  163,  164,  165,  166,  167,  168,  169,  170, 	// 0110 .Ls .Lu .M .Md .Mh .Mq .Ms .N .Na .Nd 
 171,  172,  173,  174,  175,  176,  177,  178,  179,  180, 	// 0120 .Ng .Nh .Ni .Nj .No .Np .Nq .Ns .Nu .Nv 
 181,  182,  183,  184,  185,  186,  187,  188,  189,  190, 	// 0130 .O .Oa .Od .Oh .Ot .Ou .P .Ps .Q .Qa 
 191,  192,  193,  194,  195,  196,  197,  198,  199,  200, 	// 0140 .Qd .Qh .Qp .Qq .Qs .R .Rd .Rh .S .Sa 
 201,  202,  203,  204,  205,  206,  207,  208,  209,  210, 	// 0150 .Sd .Sg .Sh .Si .Sp .Sq .Ss .Su .T .U 
 211,  212,  213,  214,  215,  216,  217,  218,  219,  220, 	// 0160 .Ua .Ud .Ug .Uh .Uj .Up .Uq .Us .Uu .Uv 
 221,  222,  223,  224,  225,  226,  227,  228,  229,  230, 	// 0170 .Uz /A /Aa /Ab /Ad /Ah /Aj /Ap /Aq /As 
 231,  232,  233,  234,  235,  236,  237,  238,  239,  240, 	// 0180 /At /Au /Ay /B /Ba /Bd /Bh /Bp /Bq /Bs 
 241,  242,  243,  244,  245,  246,  247,  248,  249,  250, 	// 0190 /Bt /Bu /C /Ca /Ch /E /Ea /Eb /Ed /Eh 
 251,  252,  253,  254,  255,  256,  257,  258,  259,  260, 	// 0200 /Ep /Eq /Es /Et /Eu /F /Fa /Fd /Fp /Fs 
 261,  262,  263,  264,  265,  266,  267,  268,  269,  270, 	// 0210 /Fu /G /Gd /Gh /Gs /Gt /Gy /H /I /Ia 
 271,  272,  273,  274,  275,  276,  277,  278,  279,  280, 	// 0220 /Id /If /Ih /Ip /Iq /Is /Iu /Iv /Iw /J 
 281,  282,  283,  284,  285,  286,  287,  288,  289,  290, 	// 0230 /Ja /Jh /Jt /Ju /K /Ka /Ku /L /Ld /Lh 
 291,  292,  293,  294,  295,  296,  297,  298,  299,  300, 	// 0240 /Lp /Lq /Lu /M /N /Na /Nd /Nh /No /Np 
 301,  302,  303,  304,  305,  306,  307,  308,  309,  310, 	// 0250 /Nq /Ns /Nu /Nv /O /Oh /Ot /Ou /P /Pa 
 311,  312,  313,  314,  315,  316,  317,  318,  319,  320, 	// 0260 /Pd /Ph /Pp /Pq /Pt /Q /Qd /Qh /Qp /Qq 
 321,  322,  323,  324,  325,  326,  327,  328,  329,  330, 	// 0270 /R /S /Sa /Sd /Sf /Sh /Sj /So /Sp /Sq 
 331,  332,  333,  334,  335,  336,  337,  338,  339,  340, 	// 0280 /Ss /Su /Sy /U /Ua /Ud /Uh /Up /Uq /Us 
 341,  342,  343,  344,  345,  346,  347,  348,  349,  350, 	// 0290 /Uu 0A 0Aa 0Ab 0Ad 0Ag 0Ah 0Ai 0Aj 0Ap 
 351,  352,  353,  354,  355,  356,  357,  358,  359,  360, 	// 0300 0Aq 0As 0At 0Au 0Av 0Aw 0Ay 0A{ 0B 0Ba 
 361,  362,  363,  364,  365,  366,  367,  368,  369,  370, 	// 0310 0Bd 0Bh 0Bp 0Bq 0Bs 0Bt 0Bu 0C 0Ca 0Cd 
 371,  372,  373,  374,  375,  376,  377,  378,  379,  380, 	// 0320 0Ch 0Cp 0Cu 0E 0Ea 0Ec 0Ed 0Eh 0Ej 0Ek 
 381,  382,  383,  384,  385,  386,  387,  388,  389,  390, 	// 0330 0Ep 0Eq 0Es 0Et 0Eu 0E{ 0F 0Fa 0Fd 0Fh 
 391,  392,  393,  394,  395,  396,  397,  398,  399,  400, 	// 0340 0Fp 0Fq 0Fs 0Ft 0Fu 0G 0Ga 0Gd 0Gh 0Gp 
 401,  402,  403,  404,  405,  406,  407,  408,  409,  410, 	// 0350 0Gq 0Gt 0Gu 0Gx 0H 0Hd 0I 0Ia 0Id 0Ih 
 411,  412,  413,  414,  415,  416,  417,  418,  419,  420, 	// 0360 0Ij 0Ip 0Iq 0Is 0Iu 0Iz 0I{ 0J 0Jd 0Jh 
 421,  422,  423,  424,  425,  426,  427,  428,  429,  430, 	// 0370 0Jt 0L 0Ld 0Lh 0Lp 0Lq 0Ls 0M 0Ma 0Md 
 431,  432,  433,  434,  435,  436,  437,  438,  439,  440, 	// 0380 0Mh 0Mq 0Ms 0Mu 0N 0Na 0Nd 0Ng 0Nh 0Np 
 441,  442,  443,  444,  445,  446,  447,  448,  449,  450, 	// 0390 0Nq 0Ns 0Nu 0O 0Ot 0P 0Q 0Qd 0Qh 0Qp 
 451,  452,  453,  454,  455,  456,  457,  458,  459,  460, 	// 0400 0Qq 0R 0Ra 0Rh 0Rp 0Rq 0Ru 0S 0Sa 0Sd 
 461,  462,  463,  464,  465,  466,  467,  468,  469,  470, 	// 0410 0Sh 0Si 0Sj 0Sp 0Sq 0Ss 0Su 0Sv 0Sz 0T 
 471,  472,  473,  474,  475,  476,  477,  478,  479,  480, 	// 0420 0Td 0Th 0U 0Ua 0Ud 0Uh 0Uj 0Up 0Uq 0Us 
 481,  482,  483,  484,  485,  486,  487,  488,  489,  490, 	// 0430 0Uu 0Uz 1A 1Aa 1Ab 1Ad 1Ag 1Ah 1Ai 1Aj 
 491,  492,  493,  494,  495,  496,  497,  498,  499,  500, 	// 0440 1Ak 1Ao 1Ap 1Aq 1As 1At 1Au 1Av 1Aw 1A{ 
 501,  502,  503,  504,  505,  506,  507,  508,  509,  510, 	// 0450 1B 1Ba 1Bd 1Bh 1Bp 1Bq 1Bs 1Bt 1Bu 1C 
 511,  512,  513,  514,  515,  516,  517,  518,  519,  520, 	// 0460 1E 1Ea 1Eb 1Ed 1Eg 1Eh 1Ej 1Ek 1Ep 1Eq 
 521,  522,  523,  524,  525,  526,  527,  528,  529,  530, 	// 0470 1Es 1Eu 1Ew 1Ez 1F 1Fa 1Fd 1Fh 1Fp 1Fq 
 531,  532,  533,  534,  535,  536,  537,  538,  539,  540, 	// 0480 1Fs 1Ft 1Fu 1G 1Gd 1Gh 1Gt 1Gu 1H 1Hd 
 541,  542,  543,  544,  545,  546,  547,  548,  549,  550, 	// 0490 1I 1Ia 1Id 1Ig 1Ih 1Ij 1Il 1Ip 1Iq 1Is 
 551,  552,  553,  554,  555,  556,  557,  558,  559,  560, 	// 0500 1Iu 1Iw 1Iy 1J 1Jd 1Jh 1K 1Kt 1L 1Ld 
 561,  562,  563,  564,  565,  566,  567,  568,  569,  570, 	// 0510 1Lh 1Lp 1Lq 1Ls 1M 1N 1Na 1Nd 1Nh 1Np 
 571,  572,  573,  574,  575,  576,  577,  578,  579,  580, 	// 0520 1Nq 1Ns 1Nu 1O 1Ot 1P 1Pu 1Q 1Qd 1Qh 
 581,  582,  583,  584,  585,  586,  587,  588,  589,  590, 	// 0530 1Qq 1Qs 1Qu 1R 1Rd 1Rh 1Rp 1Ru 1S 1Sa 
 591,  592,  593,  594,  595,  596,  597,  598,  599,  600, 	// 0540 1Sd 1Sg 1Sh 1Sj 1Sp 1Sq 1Ss 1Su 1T 1U 
 601,  602,  603,  604,  605,  606,  607,  608,  609,  610, 	// 0550 1Ua 1Ud 1Ug 1Uh 1Up 1Uq 1Us 1Ut 1Uu 1Uv 
   7,  611,  612,  613,  614,  615,  616,  617,  618,  619, 	// 0560 2 2A 2Aa 2Ad 2Ah 2Ap 2Aq 2As 2At 2Au 
 620,  621,  622,  623,  624,  625,  626,  627,  628,  629, 	// 0570 2A{ 2B 2Ba 2Bd 2Bh 2Bp 2Bq 2Bs 2Bt 2Bu 
 630,  631,  632,  633,  634,  635,  636,  637,  638,  639, 	// 0580 2E 2Ea 2Ed 2Eh 2Ej 2Ek 2Ep 2Eq 2Es 2Et 
 640,  641,  642,  643,  644,  645,  646,  647,  648,  649, 	// 0590 2Eu 2E{ 2F 2Fa 2Fd 2Fh 2Fp 2Fq 2Fs 2Ft 
 650,  651,  652,  653,  654,  655,  656,  657,  658,  659, 	// 0600 2Fu 2G 2Gt 2I 2Ia 2Id 2Ih 2Iu 2J 2Jh 
 660,  661,  662,  663,  664,  665,  666,  667,  668,  669, 	// 0610 2K 2L 2Ld 2N 2Na 2Nd 2Nh 2No 2Np 2Nu 
 670,  671,  672,  673,  674,  675,  676,  677,  678,  679, 	// 0620 2P 2Q 2Qd 2Qh 2Qp 2Qq 2Qu 2S 2Sa 2Sd 
 680,  681,  682,  683,  684,  685,  686,  687,  688,  689, 	// 0630 2Sg 2Sh 2Sp 2Sq 2Ss 2T 2Td 2Th 2Tp 2Tq 
 690,  691,  692,  693,  694,  695,  696,  697,  698,  699, 	// 0640 2U 2Ud 2Uh 2Up 2Uq 2Us 2Uu 3A 3Aa 3Ad 
 700,  701,  702,  703,  704,  705,  706,  707,  708,  709, 	// 0650 3Ah 3Ap 3Aq 3As 3At 3Au 3Av 3Az 3A{ 3B 
 710,  711,  712,  713,  714,  715,  716,  717,  718,  719, 	// 0660 3Ba 3Bd 3Bh 3Bp 3Bq 3Bs 3Bt 3Bu 3C 3Ca 
 720,  721,  722,  723,  724,  725,  726,  727,  728,  729, 	// 0670 3Cd 3Cs 3Cu 3E 3Ea 3Ed 3Eh 3Ep 3Eq 3Es 
 730,  731,  732,  733,  734,  735,  736,  737,  738,  739, 	// 0680 3Et 3Eu 3E{ 3F 3Fa 3Fd 3Fh 3Fp 3Fq 3Fs 
 740,  741,  742,  743,  744,  745,  746,  747,  748,  749, 	// 0690 3Fu 3G 3Ga 3Gd 3Gh 3Gp 3Gq 3Gs 3Gt 3Gu 
 750,  751,  752,  753,  754,  755,  756,  757,  758,  759, 	// 0700 3H 3Hd 3Hq 3Hs 3I 3Ia 3Id 3Ih 3Ip 3Iq 
 760,  761,  762,  763,  764,  765,  766,  767,  768,  769, 	// 0710 3Is 3Iu 3J 3Jd 3Ju 3Kt 3L 3Ld 3Lh 3Lp 
 770,  771,  772,  773,  774,  775,  776,  777,  778,  779, 	// 0720 3Lq 3Ls 3Lu 3M 3Md 3Mh 3Mq 3Ms 3Mu 3N 
 780,  781,  782,  783,  784,  785,  786,  787,  788,  789, 	// 0730 3Na 3Nd 3Nh 3Np 3Nq 3Ns 3Nu 3O 3Ot 3P 
 790,  791,  792,  793,  794,  795,  796,  797,  798,  799, 	// 0740 3Q 3Qa 3Qd 3Qh 3Qp 3Qs 3Qu 3R 3Ra 3Rd 
 800,  801,  802,  803,  804,  805,  806,  807,  808,  809, 	// 0750 3Rh 3Rp 3Rq 3Rs 3Ru 3S 3Sa 3Sd 3Sh 3Sp 
 810,  811,  812,  813,  814,  815,  816,  817,  818,  819, 	// 0760 3Sq 3Ss 3Su 3Sv 3Sy 3Sz 3U 3Ua 3Ud 3Uh 
 820,  821,  822,  823,  824,  825,  826,  827,  828,  829, 	// 0770 3Up 3Uq 3Us 3Uu 4A 4Aa 4Ad 4Af 4Ag 4Ah 
 830,  831,  832,  833,  834,  835,  836,  837,  838,  839, 	// 0780 4Ai 4Aj 4Ap 4Aq 4As 4Au 4Av 4Ay 4A{ 4B 
 840,  841,  842,  843,  844,  845,  846,  847,  848,  849, 	// 0790 4Ba 4Bd 4Bh 4Bp 4Bq 4Bs 4Bt 4Bu 4Bv 4C 
 850,  851,  852,  853,  854,  855,  856,  857,  858,  859, 	// 0800 4Ca 4Ch 4Cu 4E 4Ea 4Ed 4Eh 4Ej 4Ep 4Eq 
 860,  861,  862,  863,  864,  865,  866,  867,  868,  869, 	// 0810 4Es 4Eu 4Ev 4E{ 4F 4Fa 4Fd 4Fh 4Fp 4Fq 
 870,  871,  872,  873,  874,  875,  876,  877,  878,  879, 	// 0820 4Fs 4Ft 4Fu 4G 4Ga 4Gd 4Gh 4Gs 4Gt 4Gu 
 880,  881,  882,  883,  884,  885,  886,  887,  888,  889, 	// 0830 4Gw 4H 4I 4Ia 4Ic 4Id 4Ih 4Ij 4Ip 4Iq 
 890,  891,  892,  893,  894,  895,  896,  897,  898,  899, 	// 0840 4Is 4Iu 4J 4Jd 4Jt 4Ju 4L 4Ld 4Lh 4Lq 
 900,  901,  902,  903,  904,  905,  906,  907,  908,  909, 	// 0850 4Ls 4Lu 4M 4Md 4Mh 4Mq 4Ms 4N 4Na 4Nb 
 910,  911,  912,  913,  914,  915,  916,  917,  918,  919, 	// 0860 4Nd 4Ng 4Nh 4Ni 4Nj 4Np 4Nq 4Ns 4Nu 4Ny 
 920,  921,  922,  923,  924,  925,  926,  927,  928,  929, 	// 0870 4N{ 4O 4Od 4Oh 4Oq 4Os 4P 4Q 4Qd 4Qh 
 930,  931,  932,  933,  934,  935,  936,  937,  938,  939, 	// 0880 4R 4Rd 4Rh 4Rp 4Rs 4S 4Sd 4Sh 4Sp 4Ss 
 940,  941,  942,  943,  944,  945,  946,  947,  948,  949, 	// 0890 4U 4Ua 4Ud 4Ug 4Uh 4Uj 4Up 4Uq 4Us 4Ut 
 950,  951,  952,  953,  954,  955,  956,  957,  958,  959, 	// 0900 4Uu 4Uw 4Uy 5A 5Aa 5Ab 5Ac 5Ad 5Ag 5Ah 
 960,  961,  962,  963,  964,  965,  966,  967,  968,  969, 	// 0910 5Ai 5Aj 5Ak 5Ap 5Aq 5As 5Au 5Ay 5B 5Ba 
 970,  971,  972,  973,  974,  975,  976,  977,  978,  979, 	// 0920 5Bd 5Bh 5Bp 5Bq 5Bs 5Bt 5Bu 5By 5C 5Ca 
 980,  981,  982,  983,  984,  985,  986,  987,  988,  989, 	// 0930 5Cd 5Cq 5E 5Ea 5Ed 5Eg 5Eh 5Ej 5Ep 5Eq 
 990,  991,  992,  993,  994,  995,  996,  997,  998,  999, 	// 0940 5Es 5Eu 5Ev 5F 5Fa 5Fd 5Fg 5Fh 5Fp 5Fq 
1000, 1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 	// 0950 5Fs 5Ft 5Fu 5G 5Ga 5Gd 5Gh 5Gq 5Gs 5Gt 
1010, 1011, 1012, 1013, 1014, 1015, 1016, 1017, 1018, 1019, 	// 0960 5Gu 5Gy 5H 5Hd 5I 5Ia 5Ib 5Id 5Ih 5Ip 
1020, 1021, 1022, 1023, 1024, 1025, 1026, 1027, 1028, 1029, 	// 0970 5Iq 5Is 5Iu 5J 5Jd 5Jt 5K 5Kt 5L 5La 
1030, 1031, 1032, 1033, 1034, 1035, 1036, 1037, 1038, 1039, 	// 0980 5Ld 5Lh 5Lp 5Lq 5M 5Md 5N 5Na 5Nd 5Ng 
1040, 1041, 1042, 1043, 1044, 1045, 1046, 1047, 1048, 1049, 	// 0990 5Nh 5Ni 5Nj 5Np 5Nq 5Ns 5Nu 5Ny 5Nz 5O 
1050, 1051, 1052, 1053, 1054, 1055, 1056, 1057, 1058, 1059, 	// 1000 5Oh 5Ot 5P 5Q 5Qa 5Qd 5Qh 5Qu 5R 5Rd 
1060, 1061, 1062, 1063, 1064, 1065, 1066, 1067, 1068, 1069, 	// 1010 5Rh 5Rp 5Rs 5Ru 5S 5Sa 5Sd 5Sh 5Sp 5Sq 
1070, 1071, 1072, 1073, 1074, 1075, 1076, 1077, 1078, 1079, 	// 1020 5Ss 5U 5Ua 5Ud 5Uh 5Uj 5Up 5Uq 5Us 5Uu 
1080, 1081,   18, 1082, 1083, 1084, 1085, 1086, 1087, 1088, 	// 1030 5Uv 5Uw 6 6A 6Aa 6Ad 6Ah 6Aj 6Ap 6Aq 
1089, 1090, 1091, 1092, 1093, 1094, 1095, 1096, 1097, 1098, 	// 1040 6As 6At 6Au 6A{ 6B 6Ba 6Bd 6Bh 6Bp 6Bq 
1099, 1100, 1101, 1102, 1103, 1104, 1105, 1106, 1107, 1108, 	// 1050 6Bs 6Bt 6Bu 6C 6Ca 6Cp 6E 6Ea 6Ed 6Eg 
1109, 1110, 1111, 1112, 1113, 1114, 1115, 1116, 1117, 1118, 	// 1060 6Eh 6Ep 6Es 6Et 6Eu 6F 6Fu 6G 6Ga 6Gp 
1119, 1120, 1121, 1122, 1123, 1124, 1125, 1126, 1127, 1128, 	// 1070 6Gq 6Gs 6Gt 6Gu 6I 6Ia 6Id 6Ih 6Ip 6Iq 
1129, 1130, 1131, 1132, 1133, 1134, 1135, 1136, 1137, 1138, 	// 1080 6Iu 6L 6M 6Mu 6N 6Na 6Nd 6Nh 6Np 6Ns 
1139, 1140, 1141, 1142, 1143, 1144, 1145, 1146, 1147, 1148, 	// 1090 6Nu 6R 6Ru 6S 6Sd 6Sh 6Sp 6Sq 6U 6Ua 
1149, 1150, 1151, 1152, 1153, 1154, 1155, 1156, 1157, 1158, 	// 1100 6Ud 6Uh 6Up 6Uq 6Us 6Uu 7A 7Aa 7Ac 7Ad 
1159, 1160, 1161, 1162, 1163, 1164, 1165, 1166, 1167, 1168, 	// 1110 7Ag 7Ah 7Ai 7Aj 7Ap 7Aq 7As 7At 7Au 7Ay 
1169, 1170, 1171, 1172, 1173, 1174, 1175, 1176, 1177, 1178, 	// 1120 7B 7Ba 7Bd 7Bh 7Bp 7Bq 7Bs 7Bt 7Bu 7C 
1179, 1180, 1181, 1182, 1183, 1184, 1185, 1186, 1187, 1188, 	// 1130 7Ca 7Cd 7Ch 7Cp 7Cq 7Cs 7Cu 7D 7Dd 7Dh 
1189, 1190, 1191, 1192, 1193, 1194, 1195, 1196, 1197, 1198, 	// 1140 7Dp 7Du 7E 7Ea 7Eb 7Ec 7Ed 7Eg 7Eh 7Ej 
1199, 1200, 1201, 1202, 1203, 1204, 1205, 1206, 1207, 1208, 	// 1150 7Ek 7Ep 7Eq 7Es 7Et 7Eu 7Ez 7F 7Fa 7Fd 
1209, 1210, 1211, 1212, 1213, 1214, 1215, 1216, 1217, 1218, 	// 1160 7Fh 7Fp 7Fq 7Fs 7Ft 7Fu 7G 7Ga 7Gd 7Gh 
1219, 1220, 1221, 1222, 1223, 1224, 1225, 1226, 1227, 1228, 	// 1170 7Gp 7Gq 7Gs 7Gt 7Gu 7H 7Hd 7Hh 7Hu 7I 
1229, 1230, 1231, 1232, 1233, 1234, 1235, 1236, 1237, 1238, 	// 1180 7Ia 7Ib 7Id 7Ih 7Ij 7Ip 7Iq 7Is 7Iu 7Iy 
1239, 1240, 1241, 1242, 1243, 1244, 1245, 1246, 1247, 1248, 	// 1190 7J 7Ja 7Jd 7Jh 7Ju 7K 7Kd 7Kh 7Kp 7Ks 
1249, 1250, 1251, 1252, 1253, 1254, 1255, 1256, 1257, 1258, 	// 1200 7Kt 7L 7Ld 7Lh 7Lp 7Lq 7Ls 7M 7Ma 7Md 
1259, 1260, 1261, 1262, 1263, 1264, 1265, 1266, 1267, 1268, 	// 1210 7Mh 7Mp 7Mq 7Ms 7Mu 7N 7Na 7Nd 7Ng 7Nh 
1269, 1270, 1271, 1272, 1273, 1274, 1275, 1276, 1277, 1278, 	// 1220 7Np 7Nq 7Ns 7Nu 7Nw 7Ny 7Nz 7O 7Ot 7P 
1279, 1280, 1281, 1282, 1283, 1284, 1285, 1286, 1287, 1288, 	// 1230 7Pa 7Pd 7Ph 7Pp 7Pu 7Q 7Qa 7Qd 7Qh 7Qp 
1289, 1290, 1291, 1292, 1293, 1294, 1295, 1296, 1297, 1298, 	// 1240 7Qq 7Qs 7Qu 7R 7Ra 7Rh 7Rp 7Rs 7Ru 7S 
1299, 1300, 1301, 1302, 1303, 1304, 1305, 1306, 1307, 1308, 	// 1250 7Sa 7Sd 7Sh 7Si 7Sp 7Sq 7Ss 7Su 7U 7Ua 
1309, 1310, 1311, 1312, 1313, 1314, 1315, 1316, 1317, 1318, 	// 1260 7Ud 7Ug 7Uh 7Uo 7Up 7Uq 7Us 7Uu 7Uz 8A 
1319, 1320, 1321, 1322, 1323, 1324, 1325, 1326, 1327, 1328, 	// 1270 8Aa 8Ac 8Ad 8Ah 8Ap 8Aq 8At 8Au 8A{ 8B 
1329, 1330, 1331, 1332, 1333, 1334, 1335, 1336, 1337, 1338, 	// 1280 8Ba 8Bd 8Bh 8Bp 8Bq 8Bt 8Bu 8Cu 8E 8Ea 
1339, 1340, 1341, 1342, 1343, 1344, 1345, 1346, 1347, 1348, 	// 1290 8Ed 8Eh 8Ej 8Ep 8Eq 8Et 8Eu 8F 8Fd 8Fh 
1349, 1350, 1351, 1352, 1353, 1354, 1355, 1356, 1357, 1358, 	// 1300 8Hd 8I 8Ia 8Id 8Ig 8Ih 8Ij 8Ip 8Iq 8Iu 
1359, 1360, 1361, 1362, 1363, 1364, 1365, 1366, 1367, 1368, 	// 1310 8J 8Ja 8Jd 8Jt 8K 8Kt 8L 8Ld 8Lh 8Lp 
1369, 1370, 1371, 1372, 1373, 1374, 1375, 1376, 1377, 1378, 	// 1320 8Lq 8M 8N 8Na 8Nd 8Nh 8Np 8Nq 8Nu 8O 
1379, 1380, 1381, 1382, 1383, 1384, 1385, 1386, 1387, 1388, 	// 1330 8Ot 8P 8Q 8Qd 8Ru 8S 8Sa 8Sd 8Sh 8Sj 
1389, 1390, 1391, 1392, 1393, 1394, 1395, 1396, 1397, 1398, 	// 1340 8So 8Sp 8Sq 8T 8Td 8Th 8Tp 8U 8Ua 8Ud 
1399, 1400, 1401, 1402, 1403, 1404, 1405, 1406, 1407, 1408, 	// 1350 8Uh 8Up 8Uq 8Us 8Uu 9A 9Aa 9Ad 9Ae 9Af 
1409, 1410, 1411, 1412, 1413, 1414, 1415, 1416, 1417, 1418, 	// 1360 9Ah 9Ai 9Aj 9Ao 9Ap 9Aq 9As 9At 9Au 9Ay 
1419, 1420, 1421, 1422, 1423, 1424, 1425, 1426, 1427, 1428, 	// 1370 9Az 9B 9Ba 9Bd 9Bh 9Bp 9Bq 9Bs 9Bt 9Bu 
1429, 1430, 1431, 1432, 1433, 1434, 1435, 1436, 1437, 1438, 	// 1380 9C 9Ca 9Cd 9Ch 9Ck 9Cp 9Cq 9Cs 9Cu 9Cy 
1439, 1440, 1441, 1442, 1443, 1444, 1445, 1446, 1447, 1448, 	// 1390 9C{ 9D 9Dd 9Dh 9Dq 9E 9Ea 9Ed 9Ee 9Eg 
1449, 1450, 1451, 1452, 1453, 1454, 1455, 1456, 1457, 1458, 	// 1400 9Eh 9Ei 9Ej 9Ep 9Eq 9Er 9Es 9Et 9Eu 9Ev 
1459, 1460, 1461, 1462, 1463, 1464, 1465, 1466, 1467, 1468, 	// 1410 9Ex 9Ez 9F 9Fa 9Fd 9Fh 9Fp 9Fq 9Fs 9Fu 
1469, 1470, 1471, 1472, 1473, 1474, 1475, 1476, 1477, 1478, 	// 1420 9G 9Ga 9Gb 9Gd 9Gh 9Gj 9Gk 9Gp 9Gq 9Gr 
1479, 1480, 1481, 1482, 1483, 1484, 1485, 1486, 1487, 1488, 	// 1430 9Gs 9Gt 9Gu 9Gy 9Gz 9G{ 9H 9Hd 9Hh 9Hp 
1489, 1490, 1491, 1492, 1493, 1494, 1495, 1496, 1497, 1498, 	// 1440 9Hq 9Hs 9Ht 9I 9Ia 9Id 9Ih 9Ii 9Ij 9Il 
1499, 1500, 1501, 1502, 1503, 1504, 1505, 1506, 1507, 1508, 	// 1450 9Io 9Ip 9Iq 9Is 9Iu 9Iw 9J 9Ja 9Jd 9Jh 
1509, 1510, 1511, 1512, 1513, 1514, 1515, 1516, 1517, 1518, 	// 1460 9Jp 9Jq 9Js 9Jt 9Ju 9K 9Ka 9Kd 9Kp 9Ks 
1519, 1520, 1521, 1522, 1523, 1524, 1525, 1526, 1527, 1528, 	// 1470 9Ku 9L 9La 9Ld 9Lh 9Lp 9Lq 9Ls 9Lu 9M 
1529, 1530, 1531, 1532, 1533, 1534, 1535, 1536, 1537, 1538, 	// 1480 9Ma 9Md 9Mh 9Mp 9Mq 9Ms 9Mu 9N 9Na 9Nd 
1539, 1540, 1541, 1542, 1543, 1544, 1545, 1546, 1547, 1548, 	// 1490 9Nh 9Ni 9Nj 9Np 9Nq 9Ns 9Nu 9O 9Oa 9Od 
1549, 1550, 1551, 1552, 1553, 1554, 1555, 1556, 1557, 1558, 	// 1500 9Oh 9Op 9Oq 9Ot 9Ou 9P 9Pa 9Pd 9Ph 9Pp 
1559, 1560, 1561, 1562, 1563, 1564, 1565, 1566, 1567, 1568, 	// 1510 9Pq 9Pu 9Q 9Qa 9Qd 9Qh 9Qp 9Qq 9Qs 9Qu 
1569, 1570, 1571, 1572, 1573, 1574, 1575, 1576, 1577, 1578, 	// 1520 9R 9Ra 9Rd 9Rh 9Rp 9Rq 9Rs 9Ru 9Rw 9S 
1579, 1580, 1581, 1582, 1583, 1584, 1585, 1586, 1587, 1588, 	// 1530 9Sa 9Sd 9Sh 9Sn 9Sp 9Sq 9Ss 9Su 9Sv 9Sw 
1589, 1590, 1591, 1592, 1593, 1594, 1595, 1596, 1597, 1598, 	// 1540 9Sx 9Sy 9Sz 9S{ 9T 9Td 9Th 9Tp 9Ts 9U 
1599, 1600, 1601, 1602, 1603, 1604, 1605, 1606, 1607, 1608, 	// 1550 9Ua 9Ud 9Uh 9Ui 9Uj 9Uo 9Up 9Uq 9Us 9Ut 
1609, 1610, 1611, 1612, 1613, 1614, 1615, 1616, 1617, 1618, 	// 1560 9Uu 9Uv 9Uz :A :Aa :Ad :Af :Ag :Ah :Aj 
1619, 1620, 1621, 1622, 1623, 1624, 1625, 1626, 1627, 1628, 	// 1570 :Ap :Aq :As :At :Au :Av :B :Ba :Bd :Bh 
1629, 1630, 1631, 1632, 1633, 1634, 1635, 1636, 1637, 1638, 	// 1580 :Bp :Bq :Bs :Bt :Bu :C :Ca :Cd :Cf :Ch 
1639, 1640, 1641, 1642, 1643, 1644, 1645, 1646, 1647, 1648, 	// 1590 :Cp :Cu :D :Dd :Dh :E :Ea :Ed :Eh :Ej 
1649, 1650, 1651, 1652, 1653, 1654, 1655, 1656, 1657, 1658, 	// 1600 :Ep :Eq :Es :Eu :Ev :F :Fa :Fd :Fh :Fp 
1659, 1660, 1661, 1662, 1663, 1664, 1665, 1666, 1667, 1668, 	// 1610 :Fq :Fs :Fu :G :Gd :Gh :Gp :Gq :Gt :Gu 
1669, 1670, 1671, 1672, 1673, 1674, 1675, 1676, 1677, 1678, 	// 1620 :H :I :Ia :Id :Ih :Ij :Ip :Iq :Is :Iu 
1679, 1680, 1681, 1682, 1683, 1684, 1685, 1686, 1687, 1688, 	// 1630 :Iv :Iw :I{ :J :Ja :Jh :Jq :Js :Ju :K 
1689, 1690, 1691, 1692, 1693, 1694, 1695, 1696, 1697, 1698, 	// 1640 :Kt :Ku :L :Ld :Lh :Lp :Lq :Ls :Lu :M 
1699, 1700, 1701, 1702, 1703, 1704, 1705, 1706, 1707, 1708, 	// 1650 :Ma :Md :Mu :N :Na :Nd :Nh :Ni :Nj :Np 
1709, 1710, 1711, 1712, 1713, 1714, 1715, 1716, 1717, 1718, 	// 1660 :Nq :Ns :Nu :O :Ot :P :Q :Qa :Qd :Qh 
1719, 1720, 1721, 1722, 1723, 1724, 1725, 1726, 1727, 1728, 	// 1670 :Qp :Qq :Qs :R :Rd :Rh :Rp :S :Sa :Sd 
1729, 1730, 1731, 1732, 1733, 1734, 1735, 1736, 1737, 1738, 	// 1680 :Sh :Sp :Sq :Ss :Su :U :Ua :Ud :Ug :Uh 
1739, 1740, 1741, 1742, 1743, 1744, 1745, 1746,   24, 1747, 	// 1690 :Uj :Up :Uq :Us :Uu :Uv :Uy :Uz ; ;A 
1748, 1749, 1750, 1751, 1752, 1753, 1754, 1755, 1756, 1757, 	// 1700 ;Aa ;Ad ;Af ;Ah ;Ak ;Ap ;Aq ;As ;At ;Au 
1758, 1759, 1760, 1761, 1762, 1763, 1764, 1765, 1766, 1767, 	// 1710 ;B ;Ba ;Bd ;Bh ;Bp ;Bq ;Bs ;Bt ;Bu ;C 
1768, 1769, 1770, 1771, 1772, 1773, 1774, 1775, 1776, 1777, 	// 1720 ;Cd ;Cu ;E ;Ea ;Ed ;Eh ;Ep ;Eq ;Es ;Et 
1778, 1779, 1780, 1781, 1782, 1783, 1784, 1785, 1786, 1787, 	// 1730 ;Eu ;F ;Fu ;G ;Gt ;I ;Ia ;Id ;Ih ;Ip 
1788, 1789, 1790, 1791, 1792, 1793, 1794, 1795, 1796, 1797, 	// 1740 ;Iq ;Is ;Iu ;Iw ;J ;Ja ;Jh ;Jt ;K ;Kt 
1798, 1799, 1800, 1801, 1802, 1803, 1804, 1805, 1806, 1807, 	// 1750 ;L ;Ld ;Lh ;Lp ;Lq ;Mu ;N ;Na ;Nd ;Nh 
1808, 1809, 1810, 1811, 1812, 1813, 1814, 1815, 1816, 1817, 	// 1760 ;Np ;Nq ;Nu ;O ;Ot ;Ou ;Q ;R ;S ;Sp 
1818, 1819, 1820, 1821, 1822, 1823, 1824, 1825, 1826, 1827, 	// 1770 ;Ss ;Su ;U ;Ua ;Ud ;Uh ;Up ;Uq ;Uu ;Uv 
1828, 1829, 1830, 1831, 1832, 1833, 1834, 1835, 1836, 1837, 	// 1780 ;U{ <A <Aa <Ad <Af <Ah <Ap <Aq <As <At 
1838, 1839, 1840, 1841, 1842, 1843, 1844, 1845, 1846, 1847, 	// 1790 <Au <Av <B <Ba <Bd <Bh <Bp <Bq <Bs <Bt 
1848, 1849, 1850, 1851, 1852, 1853, 1854, 1855, 1856, 1857, 	// 1800 <Bu <C <Cd <Cf <Ch <Cp <Cu <E <Ea <Ed 
1858, 1859, 1860, 1861, 1862, 1863, 1864, 1865, 1866, 1867, 	// 1810 <Eh <Ep <Eq <Es <Et <Eu <F <Fa <Fd <Fh 
1868, 1869, 1870, 1871, 1872, 1873, 1874, 1875, 1876, 1877, 	// 1820 <Fp <Fq <Fs <Fu <G <Gd <Gt <H <Hd <Hu 
1878, 1879, 1880, 1881, 1882, 1883, 1884, 1885, 1886, 1887, 	// 1830 <I <Ia <Id <Ih <Ip <Iq <Is <Iu <J <Jd 
1888, 1889, 1890, 1891, 1892, 1893, 1894, 1895, 1896, 1897, 	// 1840 <Jh <Ju <L <Ld <Lh <Lp <Lq <Ls <Lu <M 
1898, 1899, 1900, 1901, 1902, 1903, 1904, 1905, 1906, 1907, 	// 1850 <Mp <N <Na <Nd <Nh <Np <Nq <Ns <Nu <O 
1908, 1909, 1910, 1911, 1912, 1913, 1914, 1915, 1916, 1917, 	// 1860 <Ot <P <Pd <Q <Qd <Qh <Qp <Qq <Qs <Qu 
1918, 1919, 1920, 1921, 1922, 1923, 1924, 1925, 1926, 1927, 	// 1870 <R <Rd <Rh <Rp <Ru <S <Sa <Sd <Sh <Sp 
1928, 1929, 1930, 1931, 1932, 1933, 1934, 1935, 1936, 1937, 	// 1880 <Sq <Ss <Su <U <Ua <Ud <Ug <Uh <Ui <Up 
1938, 1939, 1940, 1941, 1942, 1943, 1944, 1945, 1946, 1947, 	// 1890 <Uq <Us <Uu =A =Aa =Ad =Ah =Ap =Aq =As 
1948, 1949, 1950, 1951, 1952, 1953, 1954, 1955, 1956, 1957, 	// 1900 =Au =B =Ba =Bd =Bh =Bp =Bq =Bs =Bt =Bu 
1958, 1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 	// 1910 =C =Ca =Cu =E =Ea =Ed =Eg =Eh =Ep =Eq 
1968, 1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976, 1977, 	// 1920 =Es =Et =Eu =F =Fa =Fd =Fh =Fp =Fq =Fs 
1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 	// 1930 =Fu =G =Gd =Gh =Gp =Gq =Gs =Gt =Gu =H 
1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 	// 1940 =I =Ia =Id =Ih =Ip =Iq =Is =Iu =J =Ja 
1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 	// 1950 =Jd =Jh =Jp =Ju =K =Ku =L =Lh =M =N 
2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 	// 1960 =Na =Nd =Nh =Np =Nq =Ns =Nu =O =Od =Oh 
2018, 2019, 2020, 2021, 2022, 2023, 2024, 2025, 2026, 2027, 	// 1970 =Ou =P =Pu =Q =Qa =Qd =Qh =Qp =Qq =Qs 
2028, 2029, 2030, 2031, 2032, 2033, 2034, 2035, 2036, 2037, 	// 1980 =Qu =R =Rd =Rh =Rp =S =Sa =Sd =Sh =Sp 
2038, 2039, 2040, 2041, 2042, 2043, 2044, 2045, 2046, 2047, 	// 1990 =Sq =Su =U =Ua =Ud =Uh =Up =Uq =Us =Uu 
2048, 2049, 2050, 2051, 2052, 2053, 2054, 2055, 2056, 2057, 	// 2000 >A >Aa >Ad >Ah >Ai >Ap >Aq >As >At >Au 
2058, 2059, 2060, 2061, 2062, 2063, 2064, 2065, 2066, 2067, 	// 2010 >B >Ba >Bd >Bh >Bp >Bq >Bs >Bt >Bu >C 
2068, 2069, 2070, 2071, 2072, 2073, 2074, 2075, 2076, 2077, 	// 2020 >Cu >E >Ea >Ed >Eh >Ej >Ep >Eq >Es >Et 
2078, 2079, 2080, 2081, 2082, 2083, 2084, 2085, 2086, 2087, 	// 2030 >Eu >F >Fa >Fd >Fh >Fp >Fq >Fs >Fu >G 
2088, 2089, 2090, 2091, 2092, 2093, 2094, 2095, 2096, 2097, 	// 2040 >Gd >Gt >H >Hd >I >Ia >Id >Ih >Ip >Iq 
2098, 2099, 2100, 2101, 2102, 2103, 2104, 2105, 2106, 2107, 	// 2050 >Is >Iu >Iz >J >Jd >K >L >Ld >Ls >Lu 
2108, 2109, 2110, 2111, 2112, 2113, 2114, 2115, 2116, 2117, 	// 2060 >M >N >Na >Nd >Nh >Np >Nq >Ns >Nu >O 
2118, 2119, 2120, 2121, 2122, 2123, 2124, 2125, 2126, 2127, 	// 2070 >Ot >P >Q >Qa >Qd >Qh >Qp >Qq >Qu >R 
2128, 2129, 2130, 2131, 2132, 2133, 2134, 2135, 2136, 2137, 	// 2080 >Rd >Rh >Rp >Ru >S >Sa >Sd >Sg >Sh >Sj 
2138, 2139, 2140, 2141, 2142, 2143, 2144, 2145, 2146, 2147, 	// 2090 >Sp >Sq >Ss >T >Td >Th >Tp >Tq >U >Ua 
2148, 2149, 2150, 2151, 2152, 2153, 2154, 2155, 2156, 2157, 	// 2100 >Ud >Uh >Up >Uq >Us >Uu ?A ?Aa ?Ab ?Ad 
2158, 2159, 2160, 2161, 2162, 2163, 2164, 2165, 2166, 2167, 	// 2110 ?Ah ?Aj ?Ap ?Aq ?As ?At ?Au ?Ay ?B ?Ba 
2168, 2169, 2170, 2171, 2172, 2173, 2174, 2175, 2176, 2177, 	// 2120 ?Bd ?Bh ?Bp ?Bq ?Bs ?Bt ?Bu ?C ?Ca ?E 
2178, 2179, 2180, 2181, 2182, 2183, 2184, 2185, 2186, 2187, 	// 2130 ?Ea ?Ed ?Eh ?Ep ?Eq ?Es ?Et ?Eu ?F ?Fa 
2188, 2189, 2190, 2191, 2192, 2193, 2194, 2195, 2196, 2197, 	// 2140 ?Fd ?Fh ?Fp ?Fq ?Fs ?Fu ?G ?Gd ?Gh ?Gp 
2198, 2199, 2200, 2201, 2202, 2203, 2204, 2205, 2206, 2207, 	// 2150 ?Gq ?Gt ?Gu ?H ?Hh ?Hq ?Hs ?I ?Ia ?Id 
2208, 2209, 2210, 2211, 2212, 2213, 2214, 2215, 2216, 2217, 	// 2160 ?Ih ?Ip ?Iq ?Is ?Iu ?J ?Ju ?L ?Ld ?M 
2218, 2219, 2220, 2221, 2222, 2223, 2224, 2225, 2226, 2227, 	// 2170 ?Md ?Mh ?Mq ?Ms ?N ?Na ?Nd ?Ng ?Nh ?Nj 
2228, 2229, 2230, 2231, 2232, 2233, 2234, 2235, 2236, 2237, 	// 2180 ?Np ?Nq ?Ns ?Nu ?O ?Ou ?Q ?Qd ?Qh ?Qp 
2238, 2239, 2240, 2241, 2242, 2243, 2244, 2245, 2246, 2247, 	// 2190 ?Qs ?R ?Rd ?Rh ?Rp ?Rs ?Ru ?S ?Sd ?Sh 
2248, 2249, 2250, 2251, 2252, 2253, 2254, 2255, 2256, 2257, 	// 2200 ?Sp ?Sq ?Ss ?U ?Ua ?Ud ?Uh ?Up ?Uq ?Us 
2258, 2259, 2260, 2261, 2262, 2263, 2264, 2265, 2266, 2267, 	// 2210 ?Uu @A @Aa @Ad @Ah @Am @Ap @Aq @As @Au 
2268, 2269, 2270, 2271, 2272, 2273, 2274, 2275, 2276, 2277, 	// 2220 @B @Ba @Bd @Bh @Bp @Bq @Bs @Bt @Bu @C 
2278, 2279, 2280, 2281, 2282, 2283, 2284, 2285, 2286, 2287, 	// 2230 @Cu @E @Ea @Ed @Eh @Ej @Ep @Eq @Es @Eu 
2288, 2289, 2290, 2291, 2292, 2293, 2294, 2295, 2296, 2297, 	// 2240 @F @Fa @Fd @Fh @Fp @Fq @Fs @Fu @G @Ga 
2298, 2299, 2300, 2301, 2302, 2303, 2304, 2305, 2306, 2307, 	// 2250 @Gd @Gh @Gp @Gq @Gs @Gt @Gu @H @Hd @Hh 
2308, 2309, 2310, 2311, 2312, 2313, 2314, 2315, 2316, 2317, 	// 2260 @Hq @I @Ia @Id @Ih @Im @Ip @Iq @Is @Iu 
2318, 2319, 2320, 2321, 2322, 2323, 2324, 2325, 2326, 2327, 	// 2270 @Iy @J @Ja @Jd @Jh @Js @Ju @K @Ka @Kd 
2328, 2329, 2330, 2331, 2332, 2333, 2334, 2335, 2336, 2337, 	// 2280 @Ks @Ku @L @La @Ld @Lh @Lq @Ls @Lu @M 
2338, 2339, 2340, 2341, 2342, 2343, 2344, 2345, 2346, 2347, 	// 2290 @Md @Mh @Mq @Ms @N @Na @Nd @Nh @Nm @Np 
2348, 2349, 2350, 2351, 2352, 2353, 2354, 2355, 2356, 2357, 	// 2300 @Ns @Nu @O @Od @Oh @Op @Ou @P @Pa @Pd 
2358, 2359, 2360, 2361, 2362, 2363, 2364, 2365, 2366, 2367, 	// 2310 @Ph @Pu @Q @Qa @Qd @Qh @Qp @Qq @Qs @Qu 
2368, 2369, 2370, 2371, 2372, 2373, 2374, 2375, 2376, 2377, 	// 2320 @R @Ra @Rd @Rh @Rp @Rs @Ru @S @Sa @Sd 
2378, 2379, 2380, 2381, 2382, 2383, 2384, 2385, 2386, 2387, 	// 2330 @Sf @Sg @Sh @Si @Sp @Sq @Ss @Su @Sy @T 
2388, 2389, 2390, 2391, 2392, 2393, 2394, 2395, 2396, 2397, 	// 2340 @Td @Th @Tp @Tq @Tu @U @Ua @Ud @Uh @Up 
2398, 2399, 2400,   30,   31,   32,   33,   34,   35,   36, 	// 2350 @Uq @Us @Uu A B C D E F G 
  37,   38,   39,   40,   41,   42,   43,   44,   45,   46, 	// 2360 H I J K L M N O P Q 
  47,   48,   49,   50,    0,    1,    2,    3,    4,    5, 	// 2370 R S T U a b c d e f 
   6,    8,    9,   10,   11,   12,   13,   14,   15,   16, 	// 2380 g h i j k l m n o p 
  17,   19,   20,   21,   22,   23,   25,   26,   27,   28, 	// 2390 q r s t u v w x y z 
  29	// 2400 { 
};
